{
  "riddles": [
    {
      "id": "ultimate-collection-1",
      "riddle": "One strand dangles. Two strands twist. Three or more can fashion this.",
      "answer": "Braids"
    },
    {
      "id": "ultimate-collection-2",
      "riddle": "A home of wood in a wooded place, but built not by hand. High above the earthen ground, it holds its pale blue gems. What is it?",
      "answer": "A nest"
    },
    {
      "id": "ultimate-collection-3",
      "riddle": "Three or four, I can stab through or rule the seas. You know my cousins. What am I?",
      "answer": "Fork"
    },
    {
      "id": "ultimate-collection-4",
      "riddle": "What can be swallowed, but can swallow you?",
      "answer": "Pride"
    },
    {
      "id": "ultimate-collection-5",
      "riddle": "Guided, I am scraping along, leaving behind my snow-white dust against that which I am scraping, for when I am scraping, I must.",
      "answer": "Chalk"
    },
    {
      "id": "ultimate-collection-6",
      "riddle": "What word of five letters has only one left when two letters are removed?",
      "answer": "A stone"
    },
    {
      "id": "ultimate-collection-7",
      "riddle": "What gets easier to pick up the larger it gets?",
      "answer": "A woman"
    },
    {
      "id": "ultimate-collection-8",
      "riddle": "You can tumble in it, Roll in it, Burn it, Animals eat it, Used to cover floors, Still used beyond stall doors. Freshens whatever it is placed on, Absorbs whatever is poured into it. What is it?",
      "answer": "Hay"
    },
    {
      "id": "ultimate-collection-9",
      "riddle": "What's red and bad for your teeth?",
      "answer": "A brick"
    },
    {
      "id": "ultimate-collection-10",
      "riddle": "What kind of cup doesn't hold water?",
      "answer": "Cupcake"
    },
    {
      "id": "ultimate-collection-11",
      "riddle": "Two bodies with ribs, exposed.",
      "answer": "Ladder"
    },
    {
      "id": "ultimate-collection-12",
      "riddle": "Tear one off and scratch my head, what once was red is black instead!",
      "answer": "A match"
    },
    {
      "id": "ultimate-collection-13",
      "riddle": "Precious stones in a pack of cards.",
      "answer": "Diamonds"
    },
    {
      "id": "ultimate-collection-14",
      "riddle": "When young, I am sweet in the sun. When middle-aged, I make you gay. When old, I am valued more than ever.",
      "answer": "Wine"
    },
    {
      "id": "ultimate-collection-15",
      "riddle": "What's the red stuff between elephant's toes?",
      "answer": "Slow pygmies"
    },
    {
      "id": "ultimate-collection-16",
      "riddle": "Take away my first letter and I remain the same. Take away my last letter and I remain unchanged. Remove all my letters and I'm still me. What am I?",
      "answer": "A mailman"
    },
    {
      "id": "ultimate-collection-17",
      "riddle": "He has one and a person has two, a citizen has three and a human being has four, a personality has five and an inhabitant of earth has six. What am I?",
      "answer": "Syllables"
    },
    {
      "id": "ultimate-collection-18",
      "riddle": "I follow the orders of only two. I respect the work of only two. I am in constant battles with many, Though one surpassed them all. With forces joined, We created hell, Until our mutual enemy fell. Who am I?",
      "answer": "Peeves"
    },
    {
      "id": "ultimate-collection-19",
      "riddle": "What is it that leaps and runs and yet, has no feet?",
      "answer": "A ball"
    },
    {
      "id": "ultimate-collection-20",
      "riddle": "I love to dance and twist and prance, I shake my tail, as away I sail, wingless I fly into the sky. What am I?",
      "answer": "A kite"
    },
    {
      "id": "ultimate-collection-21",
      "riddle": "Travel a mile and I will change, travel a million and I will end as I started, What am I?",
      "answer": "An odometer"
    },
    {
      "id": "ultimate-collection-22",
      "riddle": "At the sound of me, men may dream Or stamp their feet At the sound of me, women may laugh Or sometimes weep.",
      "answer": "Music"
    },
    {
      "id": "ultimate-collection-23",
      "riddle": "Large as a mountain, small as a pea, Endlessly swimming in a waterless sea.",
      "answer": "Asteroids"
    },
    {
      "id": "ultimate-collection-24",
      "riddle": "What is the end to which we all like to come?",
      "answer": "Dividend"
    },
    {
      "id": "ultimate-collection-25",
      "riddle": "There is a clerk at the butcher shop, he is five feet ten inches tall, and he wears size 13 sneakers. What does he weigh?",
      "answer": "Meat"
    },
    {
      "id": "ultimate-collection-26",
      "riddle": "A child playing on the beach had 6-1/6 sand piles in one place and 3-1/3 in another. If he put them together, how many sand piles would he have?",
      "answer": "One big pile"
    },
    {
      "id": "ultimate-collection-27",
      "riddle": "A serpent swam in a silver urn, A golden bird did in its mouth abide, The serpent drank the water, this in turn, Killed the serpent. Then the gold bird died.",
      "answer": "An oil lamp"
    },
    {
      "id": "ultimate-collection-28",
      "riddle": "When is 1500 plus 20 and 1600 minus 40 the same thing?",
      "answer": "Military time"
    },
    {
      "id": "ultimate-collection-29",
      "riddle": "In ye fire thou hear me scream! Creaking and whining yet I am dead before thoust layeth me upon ye hearth.",
      "answer": "Log"
    },
    {
      "id": "ultimate-collection-30",
      "riddle": "What starts with a P, ends with an E and has a million letters in it?",
      "answer": "Post-Office"
    },
    {
      "id": "ultimate-collection-31",
      "riddle": "I have no wings but I fly, I have no teeth but I bite. What am I?",
      "answer": "A bullet"
    },
    {
      "id": "ultimate-collection-32",
      "riddle": "I know a thousand faces, and count the tailed heads, feasting bright upon the eyes, of many who have died. Wielding well a mighty power, who hath but humble stature. Masses fall upon their knees, to scarce behold my only side. What am I?",
      "answer": "A coin"
    },
    {
      "id": "ultimate-collection-33",
      "riddle": "A blue house has blue bricks; a yellow house has a yellow bricks. What is a green house made of?",
      "answer": "Glass"
    },
    {
      "id": "ultimate-collection-34",
      "riddle": "What do we all put off until tomorrow?",
      "answer": "Our clothes"
    },
    {
      "id": "ultimate-collection-35",
      "riddle": "What type of dress can never be worn?",
      "answer": "Address"
    },
    {
      "id": "ultimate-collection-36",
      "riddle": "What has one eye but cannot see?",
      "answer": "A needle"
    },
    {
      "id": "ultimate-collection-37",
      "riddle": "My father have a grey horse in him yard, ride him nowhere but on him tail.",
      "answer": "Pipe"
    },
    {
      "id": "ultimate-collection-38",
      "riddle": "I'm round at the ends and high in the middle. What am I?",
      "answer": "Ohio"
    },
    {
      "id": "ultimate-collection-39",
      "riddle": "If I have it, I don't share it. If I share it, I don't have it. What is it?",
      "answer": "A Secret"
    },
    {
      "id": "ultimate-collection-40",
      "riddle": "More precious than gold, but cannot be bought, Can never be sold, only earned if it's sought, If it is broken it can still be mended, At birth it can't start nor by death is it ended.",
      "answer": "Friendship"
    },
    {
      "id": "ultimate-collection-41",
      "riddle": "I don't have eyes, but once I did see. Once I had thoughts, but now I'm white and empty.",
      "answer": "Skull"
    },
    {
      "id": "ultimate-collection-42",
      "riddle": "I am a strong as ten men Yet ten men cannot stand me up. What am I?",
      "answer": "Water"
    },
    {
      "id": "ultimate-collection-43",
      "riddle": "I'm where yesterday follows today and tomorrow is in the middle. What am I?",
      "answer": "A dictionary"
    },
    {
      "id": "ultimate-collection-44",
      "riddle": "You will always find me in the past. I can be created in the present, But the future can never taint me. What am I?",
      "answer": "History"
    },
    {
      "id": "ultimate-collection-45",
      "riddle": "What is so delicate that even mentioning it breaks it?",
      "answer": "Silence"
    },
    {
      "id": "ultimate-collection-46",
      "riddle": "I'm a bearer of darkness. I'm feared and often hated. I'm a symbol of the unwanted, An omen that leaves you jaded. Some people can predict my coming, But then you'll forever see Things lurking around corners… Are you sure that it was me?",
      "answer": "Grim"
    },
    {
      "id": "ultimate-collection-47",
      "riddle": "What is it that no man wants, but no man wants to lose?",
      "answer": "A lawsuit"
    },
    {
      "id": "ultimate-collection-48",
      "riddle": "A couple sharing five a piece, Stretching, spreading, loudly meet, We are known to often calm, And yet were better known to harm, To help and build, our team of ten, Connects us to the minds of men. What are we?",
      "answer": "Hands and fingers"
    },
    {
      "id": "ultimate-collection-49",
      "riddle": "Although I'm not an insect, some people found me very difficult to exterminate. They called me something like 'insane priest.' The first half of my name means the same as 'scrape,' & my last three letters are a metal. Who am I?",
      "answer": "I'm Rasputin"
    },
    {
      "id": "ultimate-collection-50",
      "riddle": "What has a head, a tail, is brown, and has no legs?",
      "answer": "A penny"
    },
    {
      "id": "ultimate-collection-51",
      "riddle": "I can be long, or I can be short. I can be grown, and I can be bought. I can be painted, or left bare. I can be round, or square. What am I?",
      "answer": "Your fingernails"
    },
    {
      "id": "ultimate-collection-52",
      "riddle": "It can be cracked, It can be made, It can be told, it can be played. What is it?",
      "answer": "A joke"
    },
    {
      "id": "ultimate-collection-53",
      "riddle": "I only have one entrance, but you can come out with three exits. What am I?",
      "answer": "A blouse"
    },
    {
      "id": "ultimate-collection-54",
      "riddle": "A sugarcane without joints, whose leaves reach heaven.",
      "answer": "Prayer"
    },
    {
      "id": "ultimate-collection-55",
      "riddle": "If a green man lives in a green house, a purple man lives in a purple house, a blue man lives in a blue house, a yellow man lives in a yellow house, a black man lives in a black house. Who lives in a White house?",
      "answer": "The President"
    },
    {
      "id": "ultimate-collection-56",
      "riddle": "I am something that floats. But after a period of time I fall.",
      "answer": "A balloon"
    },
    {
      "id": "ultimate-collection-57",
      "riddle": "I have a thing, which I twine and twine and it is covered.",
      "answer": "Weaving spool"
    },
    {
      "id": "ultimate-collection-58",
      "riddle": "A man in prison has a visitor. Afterward a guard asks the inmate who the visitor was to him. The inmate replies: brothers and sisters I have none, but that man's father is my father's son. Who was the visitor to the inmate?",
      "answer": "His son"
    },
    {
      "id": "ultimate-collection-59",
      "riddle": "My sides are firmly laced about, Yet nothing is within; You'll think my head is strange indeed, Being nothing else but skin.",
      "answer": "A drum"
    },
    {
      "id": "ultimate-collection-60",
      "riddle": "Tool of thief, toy of queen. Always used to be unseen. Sign of joy, sign of sorrow. Giving all likeness borrowed.",
      "answer": "Mask"
    },
    {
      "id": "ultimate-collection-61",
      "riddle": "Why is the math book sad?",
      "answer": "It has problems"
    },
    {
      "id": "ultimate-collection-62",
      "riddle": "I am taken from a mine, and shut up in a wooden case, from which I am never released, and yet I am used by almost everybody.",
      "answer": "Pencil lead"
    },
    {
      "id": "ultimate-collection-63",
      "riddle": "Above the kingdom I reign, Spotted, speckled, with a mane, I travel in packs, And if you're lucky, you'd ride me. What am I?",
      "answer": "Giraffe"
    },
    {
      "id": "ultimate-collection-64",
      "riddle": "I have a thousand wheels, but move I do not. Call me what I am, call me a lot.",
      "answer": "Parking lot"
    },
    {
      "id": "ultimate-collection-65",
      "riddle": "There is a kind of fish that can never swim. What is that?",
      "answer": "Dead fish"
    },
    {
      "id": "ultimate-collection-66",
      "riddle": "Some are quick to take it. Others must be coaxed. Those who choose to take it gain and lose the most.",
      "answer": "Risk"
    },
    {
      "id": "ultimate-collection-67",
      "riddle": "Journey without it and you will never prevail, but if you have too much of it you will surely fail.",
      "answer": "Confidence"
    },
    {
      "id": "ultimate-collection-68",
      "riddle": "What is put on a table, cut, but never eaten?",
      "answer": "Cards"
    },
    {
      "id": "ultimate-collection-69",
      "riddle": "Early ages the iron boot tread, With Europe at her command. Through time power slipped and fled, 'til the creation of new holy land. Who am I?",
      "answer": "Rome Italy"
    },
    {
      "id": "ultimate-collection-70",
      "riddle": "What takes hours to pull off Is most satisfying when it's done And requires consent from the person you're doing it to?",
      "answer": "Hypnotism"
    },
    {
      "id": "ultimate-collection-71",
      "riddle": "What English word retains the same pronunciation, even after you take away four of its five letters?",
      "answer": "Queue"
    },
    {
      "id": "ultimate-collection-72",
      "riddle": "People buy me to eat, but never eat me. What am I?",
      "answer": "A plate"
    },
    {
      "id": "ultimate-collection-73",
      "riddle": "With head without hair. With mouth without tooth.",
      "answer": "A bottle"
    },
    {
      "id": "ultimate-collection-74",
      "riddle": "I cannot be other than what I am, Until the man who made me dies, Power and glory will fall to me finally, Only when he last closes his eyes.",
      "answer": "A prince"
    },
    {
      "id": "ultimate-collection-75",
      "riddle": "A way to say boring, minus the dane. Scat. Use, minus the e. Who am I?",
      "answer": "Mundugus"
    },
    {
      "id": "ultimate-collection-76",
      "riddle": "What always goes to bed with its shoes on?",
      "answer": "A horse"
    },
    {
      "id": "ultimate-collection-77",
      "riddle": "Lovely and round, I shine with pale light, Grown in the darkness, a lady's delight.",
      "answer": "Pearl"
    },
    {
      "id": "ultimate-collection-78",
      "riddle": "We travel much, yet prisoners are, and close confined to boot. Yet with any horse, we will keep the pace, and will always go on foot. What are they?",
      "answer": "Spurs"
    },
    {
      "id": "ultimate-collection-79",
      "riddle": "Black we are and much admired, Men seek us if they are tired, We tire the horse, comfort man, Guess this riddle if you can.",
      "answer": "Coal"
    },
    {
      "id": "ultimate-collection-80",
      "riddle": "I can be as thin as a picture frame but my insides have many things you can see.",
      "answer": "Television"
    },
    {
      "id": "ultimate-collection-81",
      "riddle": "Samuel was out for a walk and it started to rain. He did not have an umbrella and he wasn't wearing a hat. His clothes were soaked, yet not a single hair on his head got wet. How could this be?",
      "answer": "Samuel was bald"
    },
    {
      "id": "ultimate-collection-82",
      "riddle": "I have an eye but cannot see. I'm faster than any man alive and have no limbs. What am I?",
      "answer": "A hurricane"
    },
    {
      "id": "ultimate-collection-83",
      "riddle": "I come in many colors, some are blue and white. While some people annoy me, I am not much for the fight. I live where people rarely tread, but you will find me close to bed. What am I?",
      "answer": "Whales"
    },
    {
      "id": "ultimate-collection-84",
      "riddle": "Round as an apple, deep as a cup, and all the kings' horses can't fill it up. What is it?",
      "answer": "A well"
    },
    {
      "id": "ultimate-collection-85",
      "riddle": "As I went through the garden gap, Who should I meet but Dick Red-cap! A stick in his hand, a stone in his throat, If you'll tell me this riddle, I'll give you a groat.",
      "answer": "A cherry"
    },
    {
      "id": "ultimate-collection-86",
      "riddle": "A man stands outside in the rain. He has no hat, raincoat, or umbrella. His clothes are soaked, but his hair isn't wet. How is this possible?",
      "answer": "Heisbald"
    },
    {
      "id": "ultimate-collection-87",
      "riddle": "I have hands that wave you, though I never say goodbye. It's cool for you to be with me, especially when I say HI. What am I?",
      "answer": "An electric fan"
    },
    {
      "id": "ultimate-collection-88",
      "riddle": "What has a big mouth, yet never speaks?",
      "answer": "A jar"
    },
    {
      "id": "ultimate-collection-89",
      "riddle": "I have a pet, his body is full of coins",
      "answer": "A piggy bank"
    },
    {
      "id": "ultimate-collection-90",
      "riddle": "Everyone has me but nobody can lose me. What am I?",
      "answer": "A shadow"
    },
    {
      "id": "ultimate-collection-91",
      "riddle": "What is lengthened by being cut at both ends?",
      "answer": "A ditch"
    },
    {
      "id": "ultimate-collection-92",
      "riddle": "I dig out tiny caves, and store gold and silver in them. I also build bridges of silver and make crowns of gold. They are the smallest you could imagine. Sooner or later everybody needs my help, yet many people are afraid to let me help them. Who am I?",
      "answer": "Dentist"
    },
    {
      "id": "ultimate-collection-93",
      "riddle": "In the night a mountain in the morning a meadow. What am I?",
      "answer": "A bed"
    },
    {
      "id": "ultimate-collection-94",
      "riddle": "A mile from end to end, yet as close to as a friend. A precious commodity, freely given. Found on the rich, poor, short and tall, but shared among children most of all. What is it?",
      "answer": "A smile"
    },
    {
      "id": "ultimate-collection-95",
      "riddle": "I have seven letters and am something you eat. My only anagram can help your pain. If you remove my first 2 letters I wear things down. Removing my first 3 letters is an adjective and removing my first 4 letters leaves a measure of time. What am I?",
      "answer": "Sausage"
    },
    {
      "id": "ultimate-collection-96",
      "riddle": "If I say, \"Everything I tell you is a lie\", am I telling you the truth or a lie?",
      "answer": "Paradox"
    },
    {
      "id": "ultimate-collection-97",
      "riddle": "A grain of rice that occupies the entire house",
      "answer": "Light bulb"
    },
    {
      "id": "ultimate-collection-98",
      "riddle": "Squishes, Squashes, Wishes I washes, Can get it in my hair, Makes me not look too fair.",
      "answer": "Mud"
    },
    {
      "id": "ultimate-collection-99",
      "riddle": "Can you think of a crime that is punishable if attempted but not punishable is actually committed?",
      "answer": "Suicide"
    },
    {
      "id": "ultimate-collection-100",
      "riddle": "Which bird in this world flies yet suckles its young?",
      "answer": "Fruit bat"
    },
    {
      "id": "ultimate-collection-101",
      "riddle": "What lies in bed, and stands in bed? First white then red. The plumper it gets the better the old women like it?",
      "answer": "A strawberry"
    },
    {
      "id": "ultimate-collection-102",
      "riddle": "There is bomb on top of a computer; around the computer are a hairbrush, keys, phone and a cup. When the explosion comes, what item destroyed first?",
      "answer": "The bomb"
    },
    {
      "id": "ultimate-collection-103",
      "riddle": "In the sky it roams, As a dark cloud in the sky, Yet much faster, And not when nearby.",
      "answer": "Swarm of birds"
    },
    {
      "id": "ultimate-collection-104",
      "riddle": "I have Eighty-eight keys but cannot open a single door? What am I?",
      "answer": "A piano"
    },
    {
      "id": "ultimate-collection-105",
      "riddle": "What's that 7 letter word with thousands of letters in it?",
      "answer": "A mailbox"
    },
    {
      "id": "ultimate-collection-106",
      "riddle": "What makes a loud noise when changing its jacket, becomes larger but weighs less?",
      "answer": "Popcorn"
    },
    {
      "id": "ultimate-collection-107",
      "riddle": "If you eat me, my sender will eat you. What am I?",
      "answer": "A fishhook"
    },
    {
      "id": "ultimate-collection-108",
      "riddle": "I have no brain but am still smarter than the average human. What am I?",
      "answer": "Calculator"
    },
    {
      "id": "ultimate-collection-109",
      "riddle": "When pronounced, it sounds nothing like the word.",
      "answer": "A sentence"
    },
    {
      "id": "ultimate-collection-110",
      "riddle": "What grows in winter, dies in summer, and grows roots upward?",
      "answer": "An icicle"
    },
    {
      "id": "ultimate-collection-111",
      "riddle": "Whoever makes it, tells it not. Whoever takes it, knows it not. Whoever knows it, wants it not. What is it?",
      "answer": "Counterfeit money"
    },
    {
      "id": "ultimate-collection-112",
      "riddle": "A hill full, a hole full; yet you cannot catch a bowl full. What is it?",
      "answer": "A mist"
    },
    {
      "id": "ultimate-collection-113",
      "riddle": "I'm not the sort that's eaten, I'm not the sort you bake, Don't put me in an oven; I don't taste that great, But when applied correctly, around me you will find, Problems are so simple when my digits come to mind.",
      "answer": "Pi (3.14)"
    },
    {
      "id": "ultimate-collection-114",
      "riddle": "What has 4 eyes but can't see.",
      "answer": "Mississippi"
    },
    {
      "id": "ultimate-collection-115",
      "riddle": "I don't exist unless you cut me, but if you stab me I won't bleed. I hate no one yet am abhorred by all. What am I?",
      "answer": "A fart"
    },
    {
      "id": "ultimate-collection-116",
      "riddle": "I have many ears, this may be true But no matter how you shout, I'll never hear you. What am I?",
      "answer": "Cornfield"
    },
    {
      "id": "ultimate-collection-117",
      "riddle": "A father's child, a mother's child, yet no one's son.",
      "answer": "Daughter"
    },
    {
      "id": "ultimate-collection-118",
      "riddle": "A leathery snake, With a stinging bite, I'll stay coiled up, Unless I must fight.",
      "answer": "A whip"
    },
    {
      "id": "ultimate-collection-119",
      "riddle": "With me you are blind, To others and what they are, Over me you cannot see, Even though I'm in your head, I am full of myself, I think I'm better than you, I'm a horrible thing to be, Can you tell me, What am I?",
      "answer": "Ignorance"
    },
    {
      "id": "ultimate-collection-120",
      "riddle": "What jumps when it walks and sits when it stands?",
      "answer": "A kangaroo"
    },
    {
      "id": "ultimate-collection-121",
      "riddle": "Never ahead, ever behind, Yet flying swiftly past; For a child I last forever, For adults I'm gone too fast.",
      "answer": "Childhood"
    },
    {
      "id": "ultimate-collection-122",
      "riddle": "What has wings, but can not fly. Is enclosed, but can outside also lie. Can open itself up, Or close itself away. Is the place of kings and queens, And doggerel of every means. What is it upon which I stand? Which can lead us to different lands.",
      "answer": "A stage"
    },
    {
      "id": "ultimate-collection-123",
      "riddle": "Without a bridle, or a saddle, across a thing I ride a-straddle. And those I ride, by help of me, though almost blind, are made to see. What am I?",
      "answer": "Spectacles"
    },
    {
      "id": "ultimate-collection-124",
      "riddle": "What gets whiter the dirtier that it gets?",
      "answer": "A chalkboard"
    },
    {
      "id": "ultimate-collection-125",
      "riddle": "I have a mouth on my head and eat everything. What am I?",
      "answer": "A backpack"
    },
    {
      "id": "ultimate-collection-126",
      "riddle": "What do people want the least on their hands?",
      "answer": "Handcuffs"
    },
    {
      "id": "ultimate-collection-127",
      "riddle": "First you see me in the grass dressed in yellow gay; next I am in dainty white, then I fly away. What am I?",
      "answer": "A dandelion"
    },
    {
      "id": "ultimate-collection-128",
      "riddle": "What goes in the water black and comes out red?",
      "answer": "A lobster"
    },
    {
      "id": "ultimate-collection-129",
      "riddle": "Thousands of these come together to make a digital image. What is it?",
      "answer": "Pixel"
    },
    {
      "id": "ultimate-collection-130",
      "riddle": "What English word has three consecutive double letters?",
      "answer": "Bookkeeper"
    },
    {
      "id": "ultimate-collection-131",
      "riddle": "We are five little objects of an everyday sort, You will find us all in a tennis court.",
      "answer": "Vowels"
    },
    {
      "id": "ultimate-collection-132",
      "riddle": "Sometimes I am light, sometimes I am dark. What am I?",
      "answer": "Chocolate"
    },
    {
      "id": "ultimate-collection-133",
      "riddle": "A three-letter word I'm sure you know, I can be on a boat or a sleigh in the snow, I'm pals with the rain and honor a king, But my favorite use is attached to a string. What am I?",
      "answer": "A bow"
    },
    {
      "id": "ultimate-collection-134",
      "riddle": "Twigs but no roots leaves but no shoots; Faring forever over the sand. Filmmakers love me But ranchers, they hate me. I came here from Russia Isn't life grand?",
      "answer": "Russian Thistle"
    },
    {
      "id": "ultimate-collection-135",
      "riddle": "I never ask questions, but always answered. What am I?",
      "answer": "A doorbell"
    },
    {
      "id": "ultimate-collection-136",
      "riddle": "When the creeper passes, all the grass kneels.",
      "answer": "Plow"
    },
    {
      "id": "ultimate-collection-137",
      "riddle": "Your reflection can be seen here, as long as you're not moving.",
      "answer": "Water"
    },
    {
      "id": "ultimate-collection-138",
      "riddle": "What type of house weighs the least?",
      "answer": "A lighthouse"
    },
    {
      "id": "ultimate-collection-139",
      "riddle": "Of these things - I have two. One for me - and one for you. And when you ask about the price, I simply smile and nod twice.",
      "answer": "Sharing"
    },
    {
      "id": "ultimate-collection-140",
      "riddle": "Though I should be unique, you've made most of us the same. I would be stronger, if my characters were stranger.",
      "answer": "A password"
    },
    {
      "id": "ultimate-collection-141",
      "riddle": "Big as a biscuit, deep as a cup, but even a river can't fill it up. What is it?",
      "answer": "A strainer"
    },
    {
      "id": "ultimate-collection-142",
      "riddle": "I ate one and threw away two.",
      "answer": "Oyster"
    },
    {
      "id": "ultimate-collection-143",
      "riddle": "A harvest sown and reaped on the same day In an unplowed field, Which increases without growing, Remains whole though it is eaten Within and without, Is useless and yet The staple of nations.",
      "answer": "War"
    },
    {
      "id": "ultimate-collection-144",
      "riddle": "A long snake that smokes. What am I?",
      "answer": "Train"
    },
    {
      "id": "ultimate-collection-145",
      "riddle": "How many months have 28 days?",
      "answer": "All of them"
    },
    {
      "id": "ultimate-collection-146",
      "riddle": "Who is it that rows quickly with four oars but never comes out under his own roof?",
      "answer": "Turtle"
    },
    {
      "id": "ultimate-collection-147",
      "riddle": "My first is 3 letters, the mixed around, to make a different, new kind of sound. My second is a word often used to describe something that has an amazing vibe. My third is a number, that part is true. It comes right after zero and right before two. Who am I?",
      "answer": "Wonderful"
    },
    {
      "id": "ultimate-collection-148",
      "riddle": "I grow for a surface, even if you cut me. I continue to grow even after death.",
      "answer": "Hair"
    },
    {
      "id": "ultimate-collection-149",
      "riddle": "I am not alive but I grow. I don't have lungs but I need air. What am i?",
      "answer": "Fire"
    },
    {
      "id": "ultimate-collection-150",
      "riddle": "Not a priest, not a king but wears different kinds of clothes.",
      "answer": "Clothesline"
    },
    {
      "id": "ultimate-collection-151",
      "riddle": "Blend a teapot shot so the pearlies won't rot!",
      "answer": "Toothpaste"
    },
    {
      "id": "ultimate-collection-152",
      "riddle": "Walk on the living, they don't even mumble. Walk on the dead, they mutter and grumble",
      "answer": "Leaves"
    },
    {
      "id": "ultimate-collection-153",
      "riddle": "Today he is there to trip you up and he will torture you tomorrow.",
      "answer": "Homework"
    },
    {
      "id": "ultimate-collection-154",
      "riddle": "The more you take the more you leave behind.",
      "answer": "Footsteps"
    },
    {
      "id": "ultimate-collection-155",
      "riddle": "Oh how I love my dancing feet! They stay together - oh so neat. And when I want to walk a line, They all stay together and do double time. I count them up, ten times or more, And race on-off, across the floor.",
      "answer": "Centipede"
    },
    {
      "id": "ultimate-collection-156",
      "riddle": "What heavy seven letter word can you take two away from and be left with eight?",
      "answer": "Weights"
    },
    {
      "id": "ultimate-collection-157",
      "riddle": "You use a knife to slice my head and weep beside me when I am dead. What am I?",
      "answer": "Onion"
    },
    {
      "id": "ultimate-collection-158",
      "riddle": "Ne'er the same, In multitude you see me. You love me, you hate me, What am I? What am I?",
      "answer": "People"
    },
    {
      "id": "ultimate-collection-159",
      "riddle": "Shorter than my four siblings, but easily the strongest, Sometimes I wear a funny hat.",
      "answer": "Thumb"
    },
    {
      "id": "ultimate-collection-160",
      "riddle": "I have joy in bringing two together, but darning my existence! My life hangs by a thread, filled with ups, downs and resistance!",
      "answer": "Needle"
    },
    {
      "id": "ultimate-collection-161",
      "riddle": "What has ten letters and starts with gas?",
      "answer": "Automobile"
    },
    {
      "id": "ultimate-collection-162",
      "riddle": "Looks like water, but it's heat. Sits on sand, lays on concrete. People have been known, To follow it everywhere. But it gets them no place, And all they can do is stare.",
      "answer": "Mirage"
    },
    {
      "id": "ultimate-collection-163",
      "riddle": "Flour of England, fruit of Spain, Met together in a shower of rain; Put in a bag tied round with a string, If you'll tell me this riddle, I'll give you a ring.",
      "answer": "Plum pudding"
    },
    {
      "id": "ultimate-collection-164",
      "riddle": "What is it something that you always have but you always leave behind?",
      "answer": "Fingerprints"
    },
    {
      "id": "ultimate-collection-165",
      "riddle": "In my place, I am the figure of authority. I housed evil unknowingly. I gave it away to instruction which soon led to the world's destruction. What is my last name?",
      "answer": "Pandora"
    },
    {
      "id": "ultimate-collection-166",
      "riddle": "Wednesday, Tom and Joe went to a restaurant and ate dinner. When they were done they paid for the food and left. But Tom and Joe didn't pay for the food. Who did?",
      "answer": "Wednesday"
    },
    {
      "id": "ultimate-collection-167",
      "riddle": "What does an old tan broken down house wear outside?",
      "answer": "Address"
    },
    {
      "id": "ultimate-collection-168",
      "riddle": "Everyone has it. Those who have it least don't know that they have it. Those who have it most wish they had less of it, But not too little or none at all.",
      "answer": "Age"
    },
    {
      "id": "ultimate-collection-169",
      "riddle": "Hickory-Dickory-Dock! The mouse ran up the clock. The clock struck one, And down did come. Hickory-Dickory-Dock! What am I?",
      "answer": "Mouse"
    },
    {
      "id": "ultimate-collection-170",
      "riddle": "What goes through a door but never goes in and never comes out?",
      "answer": "Keyhole"
    },
    {
      "id": "ultimate-collection-171",
      "riddle": "On the wall, in the air, You just want me out of your hair, Try to catch me, but you cannot, For my vision is thousand fold. What am I?",
      "answer": "Fly"
    },
    {
      "id": "ultimate-collection-172",
      "riddle": "Iron roof, glass walls, burns and burns and never falls.",
      "answer": "Lantern"
    },
    {
      "id": "ultimate-collection-173",
      "riddle": "We hurt without moving. We poison without touching. We bear the truth and the lies. We are not to be judged by our size. What are we?",
      "answer": "Words"
    },
    {
      "id": "ultimate-collection-174",
      "riddle": "I can bring tears to your eyes; resurrect the dead, make you smile, and reverse time. I form in an instant but I last a lifetime. What am I?",
      "answer": "Memory"
    },
    {
      "id": "ultimate-collection-175",
      "riddle": "Slayer of regrets, old and new, sought by many, found by few.",
      "answer": "Redemption"
    },
    {
      "id": "ultimate-collection-176",
      "riddle": "You use me for multiple reasons, I am many colored, and many shaped. I may or may not also tell you your sexual preference. What am I?",
      "answer": "Flag"
    },
    {
      "id": "ultimate-collection-177",
      "riddle": "I build up castles. I tear down mountains. I make some men blind, I help others to see. What am I?",
      "answer": "Sand"
    },
    {
      "id": "ultimate-collection-178",
      "riddle": "All day long it's in and out. I discharge loads from my shaft. Both men and women go down on me. What am I?",
      "answer": "Elevator"
    },
    {
      "id": "ultimate-collection-179",
      "riddle": "Two birds, trying to balance in one twig.",
      "answer": "Earrings"
    },
    {
      "id": "ultimate-collection-180",
      "riddle": "Thousands lay up gold within this house, But no man made it. Spears past counting guard this house, But no man wards it.",
      "answer": "Beehive"
    },
    {
      "id": "ultimate-collection-181",
      "riddle": "I have one eye, See near and far, I hold the moments you treasure, And the things that make you weep.",
      "answer": "Camera"
    },
    {
      "id": "ultimate-collection-182",
      "riddle": "When it was young, it had a tail. When it grew up, it had knees.",
      "answer": "Frog"
    },
    {
      "id": "ultimate-collection-183",
      "riddle": "You'll have me at night and if you remove the first letter I denote the top, such as on a train.",
      "answer": "Car"
    },
    {
      "id": "ultimate-collection-184",
      "riddle": "Kills the bad ones and the sad ones. Tightens to fit, so one size fits.",
      "answer": "Noose"
    },
    {
      "id": "ultimate-collection-185",
      "riddle": "Big Square Bag of Mr. Jacob, to use it, you have to turn it upside down.",
      "answer": "Pocket"
    },
    {
      "id": "ultimate-collection-186",
      "riddle": "Stars awash in a sheen of light, It calls out loud in vile delight. Listeners endure in fright. Vicious brute that reigns at night, Evil whelped of heinous bite, Renewed by wax, it regains might. A leading way to slay the beast, Get the hidden weapon thus released. What is this describing?",
      "answer": "Vampire"
    },
    {
      "id": "ultimate-collection-187",
      "riddle": "What can you throw but not catch?",
      "answer": "A party"
    },
    {
      "id": "ultimate-collection-188",
      "riddle": "What does a turkey do when he flies upside down?",
      "answer": "Gobbles up"
    },
    {
      "id": "ultimate-collection-189",
      "riddle": "What goes in the water red, and comes out black?",
      "answer": "Iron"
    },
    {
      "id": "ultimate-collection-190",
      "riddle": "What's as small as a mouse but guards a house like a lion?",
      "answer": "Lock"
    },
    {
      "id": "ultimate-collection-191",
      "riddle": "If a chicken says, all chickens are liars is the chicken telling the truth?",
      "answer": "Paradox"
    },
    {
      "id": "ultimate-collection-192",
      "riddle": "Fear of what I would become haunted my blood. Both can be seen as a curse Though one is much much worse. It was the luck of the draw, you can say, That I came out this way. So, I guess, with my changing physique, I can be seen as quite unique. Who am I?",
      "answer": "Werewolf"
    },
    {
      "id": "ultimate-collection-193",
      "riddle": "Begotten, and Born, and dying with Noise, The Terror of Women, and Pleasure of Boys, Like the Fiction of Poets concerning the Wind, I'm chiefly unruly, when strongest confined.",
      "answer": "Fart"
    },
    {
      "id": "ultimate-collection-194",
      "riddle": "Sharp and long, flag of the world.",
      "answer": "Thorn"
    },
    {
      "id": "ultimate-collection-195",
      "riddle": "What is something to everybody and nothing to everyone else?",
      "answer": "Mind"
    },
    {
      "id": "ultimate-collection-196",
      "riddle": "What has a foot but no leg?",
      "answer": "Ruler"
    },
    {
      "id": "ultimate-collection-197",
      "riddle": "You can't see, you can't touch, and yet you were fascinated by me.",
      "answer": "Story"
    },
    {
      "id": "ultimate-collection-198",
      "riddle": "Within, I clean all that is bad and is old. I make juice that's the color of gold. Should I die, a filter machine would you need assembled to replace me and beans I resemble.",
      "answer": "Kidney"
    },
    {
      "id": "ultimate-collection-199",
      "riddle": "I am a seed, three letters in the name, Take away two and I sound quite the same. What am I?",
      "answer": "Pea"
    },
    {
      "id": "ultimate-collection-200",
      "riddle": "What is never used unless it's in a tight place?",
      "answer": "Cork"
    },
    {
      "id": "ultimate-collection-201",
      "riddle": "Thirty white horses on a red hill, First they champ, Then they stamp, Then they stand still.",
      "answer": "Teeth"
    },
    {
      "id": "ultimate-collection-202",
      "riddle": "I can turn into a car, building or even a robot. I'm man made and my siblings and I outnumber you sixty-two to one. My name means, Play well in my creator's native tongue. What am I?",
      "answer": "Lego"
    },
    {
      "id": "ultimate-collection-203",
      "riddle": "What has feet and legs and nothing else?",
      "answer": "Stockings"
    },
    {
      "id": "ultimate-collection-204",
      "riddle": "The virgin gave birth to a child and threw away the blanket.",
      "answer": "Banana"
    },
    {
      "id": "ultimate-collection-205",
      "riddle": "You can only have it once you have given it.",
      "answer": "Respect"
    },
    {
      "id": "ultimate-collection-206",
      "riddle": "Many have heard me, but nobody has seen me, and I will not speak back until spoken to. What am I?",
      "answer": "Echo"
    },
    {
      "id": "ultimate-collection-207",
      "riddle": "Although my cow is dead, I still beat her. What a racket she makes!",
      "answer": "Drum"
    },
    {
      "id": "ultimate-collection-208",
      "riddle": "What asks but never answers?",
      "answer": "Owl"
    },
    {
      "id": "ultimate-collection-209",
      "riddle": "I went to the woods and got it, when I got it didn't want it, looked for it, couldn't find it so I took it home.",
      "answer": "Splinter"
    },
    {
      "id": "ultimate-collection-210",
      "riddle": "What always ends everything?",
      "answer": "The letter G"
    },
    {
      "id": "ultimate-collection-211",
      "riddle": "What goes \"oh oh oh\"?",
      "answer": "Santa walking backwards"
    },
    {
      "id": "ultimate-collection-212",
      "riddle": "A dad and his four boys stand in line. All crowned, they toil in darkness. Another family they see, two birds of a feather. All of them together clad in leather.",
      "answer": "Hand in glove"
    },
    {
      "id": "ultimate-collection-213",
      "riddle": "I'm a gift that you'll hate. I'm tough to create. With my emblem, you'll be distinguished As a clan of blood-pride extinguished.",
      "answer": "Coat of arms"
    },
    {
      "id": "ultimate-collection-214",
      "riddle": "What falls but never breaks and breaks but never falls?",
      "answer": "Night and day"
    },
    {
      "id": "ultimate-collection-215",
      "riddle": "I start at the finish and finish on the start. How?",
      "answer": "Racetrack"
    },
    {
      "id": "ultimate-collection-216",
      "riddle": "I'm so simple I only point, Yet I guide people all over the world. What am I?",
      "answer": "Compass"
    },
    {
      "id": "ultimate-collection-217",
      "riddle": "Armless, legless, I crawl around when I'm young. Then the time of changing sleep will come. I will awake like a newborn, flying beast, 'till then on the remains of the dead I feast.",
      "answer": "Maggot"
    },
    {
      "id": "ultimate-collection-218",
      "riddle": "I am used for many things like war and destruction, yet also in speech. What am I?",
      "answer": "Tongue"
    },
    {
      "id": "ultimate-collection-219",
      "riddle": "I sit in parliament. You'll only see me at night... What am I?",
      "answer": "Owl"
    },
    {
      "id": "ultimate-collection-220",
      "riddle": "A tree with 5 branches, no leaves and no fruits.",
      "answer": "Hand"
    },
    {
      "id": "ultimate-collection-221",
      "riddle": "My step is slow, the snow's my breath I give the ground, a grinding death My marching makes an end of me Slain by sun or drowned in sea.",
      "answer": "Glacier"
    },
    {
      "id": "ultimate-collection-222",
      "riddle": "I am one of many, You forget I'm here, but I'm just below. Without me, you'd surely topple, Go ahead, what am I?",
      "answer": "Toe"
    },
    {
      "id": "ultimate-collection-223",
      "riddle": "I go in dry and come out wet, The longer I'm in, the stronger I get. What am I?",
      "answer": "Teabag"
    },
    {
      "id": "ultimate-collection-224",
      "riddle": "What's the difference between a well-dressed man on a bicycle and a poorly-dressed man on a tricycle?",
      "answer": "Attire"
    },
    {
      "id": "ultimate-collection-225",
      "riddle": "I am born in fear, raised in truth, And I come to my own in deed. When comes a time that I'm called forth, I come to serve the cause of need.",
      "answer": "Courage"
    },
    {
      "id": "ultimate-collection-226",
      "riddle": "With pointed fangs it sits in wait, With piercing force it doles out fate, Over bloodless victims proclaiming its might, Eternally joining in a single bite What is it?",
      "answer": "Stapler"
    },
    {
      "id": "ultimate-collection-227",
      "riddle": "What is all over a house?",
      "answer": "Roof"
    },
    {
      "id": "ultimate-collection-228",
      "riddle": "Name any word that becomes shorter even when you add 2 more letters to it?",
      "answer": "Short"
    },
    {
      "id": "ultimate-collection-229",
      "riddle": "Forever trapped, I have no choice, It is the curse of this life, Just for others like me, Though, if you wander across a kind soul, You may receive a special gift Which will set you free What am I?",
      "answer": "Genie"
    },
    {
      "id": "ultimate-collection-230",
      "riddle": "I saw a man in white, he looked quite a sight. He was not old, but he stood in the cold. And when he felt the sun, he started to run. Who could he be? Please answer me.",
      "answer": "Snowman"
    },
    {
      "id": "ultimate-collection-231",
      "riddle": "My first is in wield, sever bones and marrow. My second is in blade, forged in cold steel. My third is in arbalest, and also in arrows. My fourth is in power, plunged through a shield. My fifth is in honor, and also in vows My last will put an end to it all.",
      "answer": "Weapon"
    },
    {
      "id": "ultimate-collection-232",
      "riddle": "Not born, but from a Mother's body drawn, I hang until half of me is gone. I sleep in a cave until I grow old, then valued for my hardened gold. What am I?",
      "answer": "Cheese"
    },
    {
      "id": "ultimate-collection-233",
      "riddle": "The captain took a bath without his belly getting wet.",
      "answer": "Boat"
    },
    {
      "id": "ultimate-collection-234",
      "riddle": "What kind of room doesn't have physical walls?",
      "answer": "Mushroom"
    },
    {
      "id": "ultimate-collection-235",
      "riddle": "I have no life, but I can die, what am I?",
      "answer": "Battery"
    },
    {
      "id": "ultimate-collection-236",
      "riddle": "April showers bring May flowers. What do May flowers bring?",
      "answer": "Pilgrims"
    },
    {
      "id": "ultimate-collection-237",
      "riddle": "Break it and it is better, immediately set and harder to break again.",
      "answer": "Record"
    },
    {
      "id": "ultimate-collection-238",
      "riddle": "If you have me, you want to tell me. If you tell me, you don't have me.",
      "answer": "Secret"
    },
    {
      "id": "ultimate-collection-239",
      "riddle": "Born of sorrow, grows with age, You need a lot to be a sage. What is it?",
      "answer": "Wisdom"
    },
    {
      "id": "ultimate-collection-240",
      "riddle": "There are two meanings to me. With one I may need to be broken, with the other I hold on. My favorite characteristic is my charming dimple. What am I?",
      "answer": "Tie"
    },
    {
      "id": "ultimate-collection-241",
      "riddle": "You can easily touch me, but not see me. You can throw me out, but not away. What am I?",
      "answer": "Your back"
    },
    {
      "id": "ultimate-collection-242",
      "riddle": "If you live in an 11-floor house and everything is green, the house, blender, toilet, elevator, ribbon, couch, computer, plates, food! You get to the 6th floor and there are no more stairs how did you get to the 11th floor?",
      "answer": "Green elevator"
    },
    {
      "id": "ultimate-collection-243",
      "riddle": "To unravel me, you need a key. No key that was made by locksmith's hand, but a key that only I will understand. What am I?",
      "answer": "Cipher"
    },
    {
      "id": "ultimate-collection-244",
      "riddle": "As beautiful as the setting sun, As delicate as the morning dew; An angel's dusting from the stars, That can turn the Earth into a frosted moon. What am I?",
      "answer": "Snow"
    },
    {
      "id": "ultimate-collection-245",
      "riddle": "There is a word in the English language in which the first two letters signify a male, the first three letters signify a female, the first four signify a great man, and the whole word, a great woman. What is the word?",
      "answer": "Heroine"
    },
    {
      "id": "ultimate-collection-246",
      "riddle": "The shorter I am, the bigger I am. What am I?",
      "answer": "Temper"
    },
    {
      "id": "ultimate-collection-247",
      "riddle": "Air that is expelled orally.",
      "answer": "Breath"
    },
    {
      "id": "ultimate-collection-248",
      "riddle": "I am made from an animal, Although you nickname me after a different one. You can't eat me; you can only hold me, And once a year a festival is erected in my honor. What am I? I am made from an animal,",
      "answer": "Pigskin"
    },
    {
      "id": "ultimate-collection-249",
      "riddle": "The sun bakes them, the hand breaks them, the foot treads on them, and the mouth tastes them. What are they?",
      "answer": "Grapes"
    },
    {
      "id": "ultimate-collection-250",
      "riddle": "What is a Mummy's favorite type of music?",
      "answer": "Wrap"
    },
    {
      "id": "ultimate-collection-251",
      "riddle": "I can sizzle like bacon, I am made with an egg, I have plenty of backbone, but lack a good leg. I peel layers like onions, but still remain whole. I can be long like a flagpole, yet fit in a hole. What am I?",
      "answer": "Snake"
    },
    {
      "id": "ultimate-collection-252",
      "riddle": "I'm lighter than air but a million men can't lift me. What am I?",
      "answer": "Bubble"
    },
    {
      "id": "ultimate-collection-253",
      "riddle": "The sharp slim blade, that cuts the wind. What is it?",
      "answer": "Grass"
    },
    {
      "id": "ultimate-collection-254",
      "riddle": "What do thief's get for stealing calendars?",
      "answer": "12 months"
    },
    {
      "id": "ultimate-collection-255",
      "riddle": "Until I am measured, I am not known. Yet how you miss me when I have flown. What am I?",
      "answer": "Time"
    },
    {
      "id": "ultimate-collection-256",
      "riddle": "What has a coat? Hugs you not in sympathy? Whose smile you'd rather not see? Whose stance is a terrible thing to see? Who is it that brave men run away from? Whose fingers are clawed? Whose sleep lasts for months? And who's company we shunt?",
      "answer": "Bear"
    },
    {
      "id": "ultimate-collection-257",
      "riddle": "A woman who lives in New York legally married three men. She didn't get divorce, get an annulment or legally separated. How is this possible?",
      "answer": "She's a minister"
    },
    {
      "id": "ultimate-collection-258",
      "riddle": "I cut through evil Like a double edged sword, And chaos flees at my approach. Balance I single-handedly upraise, Through battles fought with heart and mind, Instead of with my gaze. What am I?",
      "answer": "Justice"
    },
    {
      "id": "ultimate-collection-259",
      "riddle": "What can travel around the world while staying in a corner?",
      "answer": "Stamp"
    },
    {
      "id": "ultimate-collection-260",
      "riddle": "I defend without weapons, stand without legs, wound without force, and am harder to fight than to kill. What am I?",
      "answer": "Lies"
    },
    {
      "id": "ultimate-collection-261",
      "riddle": "I have a leg but I do not move, A face but no expression, Be it wind or rain I stay outside. What am I?",
      "answer": "Scarecrow"
    },
    {
      "id": "ultimate-collection-262",
      "riddle": "Which side of a cat has the most fur?",
      "answer": "Outside"
    },
    {
      "id": "ultimate-collection-263",
      "riddle": "What kind of room has no doors or windows?",
      "answer": "Mushroom"
    },
    {
      "id": "ultimate-collection-264",
      "riddle": "I have a hundred legs but cannot stand, a long neck but no head; I eat the maid's life. What am I?",
      "answer": "Broom"
    },
    {
      "id": "ultimate-collection-265",
      "riddle": "The word CANDY can be spelled using just 2 letters. Can you figure out how?",
      "answer": "C and Y"
    },
    {
      "id": "ultimate-collection-266",
      "riddle": "You may always chase me but you are always about 3 miles away. What am I?",
      "answer": "Horizon"
    },
    {
      "id": "ultimate-collection-267",
      "riddle": "I look flat, but I am deep, Hidden realms I shelter. Lives I take, but food I offer. At times I am beautiful. I can be calm, angry and turbulent. I have no heart, but offer pleasure as well as death. No man can own me, yet I encompass what all men must have.",
      "answer": "Ocean"
    },
    {
      "id": "ultimate-collection-268",
      "riddle": "Many shapes, many sizes. Can't be seen, only felt. I bring pain, I bring joy, I bring laughter, I bring happiness. I can tear the mightiest from their thrones, and those who have me are rich. What am I?",
      "answer": "Emotion"
    },
    {
      "id": "ultimate-collection-269",
      "riddle": "They can be harbored, but few hold water, You can nurse them, but only by holding them against someone else, You can carry them, but not with your arms, You can bury them, but not in the earth.",
      "answer": "Grudges"
    },
    {
      "id": "ultimate-collection-270",
      "riddle": "Anna brings her; she brings Anna, with her wherever she goes.",
      "answer": "Banana"
    },
    {
      "id": "ultimate-collection-271",
      "riddle": "I bind it and it walks. I loose it and it stops.",
      "answer": "Sandal"
    },
    {
      "id": "ultimate-collection-272",
      "riddle": "It has a long neck, A name of a bird, Feeds on cargo of ships, It's not alive,",
      "answer": "Crane"
    },
    {
      "id": "ultimate-collection-273",
      "riddle": "Downward grows the root. Outward grows the skin. Upward grows the shoot. What way blows the wind?",
      "answer": "Nowhere"
    },
    {
      "id": "ultimate-collection-274",
      "riddle": "What loses its head every morning only to get it back every night?",
      "answer": "Pillow"
    },
    {
      "id": "ultimate-collection-275",
      "riddle": "I have 10 fingers and 10 toes, I have 2 eyes a mouth and nose, I'll always be beside you through thick and thin, Not through body, but through my spirit within. What am I?",
      "answer": "Doll"
    },
    {
      "id": "ultimate-collection-276",
      "riddle": "I have a tongue, but cannot speak. I have a bed but cannot sleep. I have four legs but cannot walk. Yet I move as you do. What am I?",
      "answer": "Wagon"
    },
    {
      "id": "ultimate-collection-277",
      "riddle": "I fall with the waves, rise with the tide, and drift with the current alongside. What am I?",
      "answer": "Seaweed"
    },
    {
      "id": "ultimate-collection-278",
      "riddle": "The strangest creature you'll ever find: Two eyes in front and many many more behind.",
      "answer": "Peacock"
    },
    {
      "id": "ultimate-collection-279",
      "riddle": "Two children are born on the same day from the same mother but they are not twins. How is that possible?",
      "answer": "Triplets"
    },
    {
      "id": "ultimate-collection-280",
      "riddle": "Tall when seated, short when standing.",
      "answer": "Dog"
    }
  ]
}
