{
  "riddles": [
    {
      "id": "ultimate-collection-1",
      "riddle": "One strand dangles. Two strands twist. Three or more can fashion this.",
      "answer": "Braids"
    },
    {
      "id": "ultimate-collection-2",
      "riddle": "A home of wood in a wooded place, but built not by hand. High above the earthen ground, it holds its pale blue gems. What is it?",
      "answer": "A nest"
    },
    {
      "id": "ultimate-collection-3",
      "riddle": "Three or four, I can stab through or rule the seas. You know my cousins. What am I?",
      "answer": "Fork"
    },
    {
      "id": "ultimate-collection-4",
      "riddle": "What can be swallowed, but can swallow you?",
      "answer": "Pride"
    },
    {
      "id": "ultimate-collection-5",
      "riddle": "Guided, I am scraping along, leaving behind my snow-white dust against that which I am scraping, for when I am scraping, I must.",
      "answer": "Chalk"
    },
    {
      "id": "ultimate-collection-6",
      "riddle": "What word of five letters has only one left when two letters are removed?",
      "answer": "A stone"
    },
    {
      "id": "ultimate-collection-7",
      "riddle": "What gets easier to pick up the larger it gets?",
      "answer": "A woman"
    },
    {
      "id": "ultimate-collection-8",
      "riddle": "You can tumble in it, Roll in it, Burn it, Animals eat it, Used to cover floors, Still used beyond stall doors. Freshens whatever it is placed on, Absorbs whatever is poured into it. What is it?",
      "answer": "Hay"
    },
    {
      "id": "ultimate-collection-9",
      "riddle": "What's red and bad for your teeth?",
      "answer": "A brick"
    },
    {
      "id": "ultimate-collection-10",
      "riddle": "What kind of cup doesn't hold water?",
      "answer": "Cupcake"
    },
    {
      "id": "ultimate-collection-11",
      "riddle": "Two bodies with ribs, exposed.",
      "answer": "Ladder"
    },
    {
      "id": "ultimate-collection-12",
      "riddle": "Tear one off and scratch my head, what once was red is black instead!",
      "answer": "A match"
    },
    {
      "id": "ultimate-collection-13",
      "riddle": "Precious stones in a pack of cards.",
      "answer": "Diamonds"
    },
    {
      "id": "ultimate-collection-14",
      "riddle": "When young, I am sweet in the sun. When middle-aged, I make you gay. When old, I am valued more than ever.",
      "answer": "Wine"
    },
    {
      "id": "ultimate-collection-15",
      "riddle": "What's the red stuff between elephant's toes?",
      "answer": "Slow pygmies"
    },
    {
      "id": "ultimate-collection-16",
      "riddle": "Take away my first letter and I remain the same. Take away my last letter and I remain unchanged. Remove all my letters and I'm still me. What am I?",
      "answer": "A mailman"
    },
    {
      "id": "ultimate-collection-17",
      "riddle": "He has one and a person has two, a citizen has three and a human being has four, a personality has five and an inhabitant of earth has six. What am I?",
      "answer": "Syllables"
    },
    {
      "id": "ultimate-collection-18",
      "riddle": "I follow the orders of only two. I respect the work of only two. I am in constant battles with many, Though one surpassed them all. With forces joined, We created hell, Until our mutual enemy fell. Who am I?",
      "answer": "Peeves"
    },
    {
      "id": "ultimate-collection-19",
      "riddle": "What is it that leaps and runs and yet, has no feet?",
      "answer": "A ball"
    },
    {
      "id": "ultimate-collection-20",
      "riddle": "I love to dance and twist and prance, I shake my tail, as away I sail, wingless I fly into the sky. What am I?",
      "answer": "A kite"
    },
    {
      "id": "ultimate-collection-21",
      "riddle": "Travel a mile and I will change, travel a million and I will end as I started, What am I?",
      "answer": "An odometer"
    },
    {
      "id": "ultimate-collection-22",
      "riddle": "At the sound of me, men may dream Or stamp their feet At the sound of me, women may laugh Or sometimes weep.",
      "answer": "Music"
    },
    {
      "id": "ultimate-collection-23",
      "riddle": "Large as a mountain, small as a pea, Endlessly swimming in a waterless sea.",
      "answer": "Asteroids"
    },
    {
      "id": "ultimate-collection-24",
      "riddle": "What is the end to which we all like to come?",
      "answer": "Dividend"
    },
    {
      "id": "ultimate-collection-25",
      "riddle": "There is a clerk at the butcher shop, he is five feet ten inches tall, and he wears size 13 sneakers. What does he weigh?",
      "answer": "Meat"
    },
    {
      "id": "ultimate-collection-26",
      "riddle": "A child playing on the beach had 6-1/6 sand piles in one place and 3-1/3 in another. If he put them together, how many sand piles would he have?",
      "answer": "One big pile"
    },
    {
      "id": "ultimate-collection-27",
      "riddle": "A serpent swam in a silver urn, A golden bird did in its mouth abide, The serpent drank the water, this in turn, Killed the serpent. Then the gold bird died.",
      "answer": "An oil lamp"
    },
    {
      "id": "ultimate-collection-28",
      "riddle": "When is 1500 plus 20 and 1600 minus 40 the same thing?",
      "answer": "Military time"
    },
    {
      "id": "ultimate-collection-29",
      "riddle": "In ye fire thou hear me scream! Creaking and whining yet I am dead before thoust layeth me upon ye hearth.",
      "answer": "Log"
    },
    {
      "id": "ultimate-collection-30",
      "riddle": "What starts with a P, ends with an E and has a million letters in it?",
      "answer": "Post-Office"
    },
    {
      "id": "ultimate-collection-31",
      "riddle": "I have no wings but I fly, I have no teeth but I bite. What am I?",
      "answer": "A bullet"
    },
    {
      "id": "ultimate-collection-32",
      "riddle": "I know a thousand faces, and count the tailed heads, feasting bright upon the eyes, of many who have died. Wielding well a mighty power, who hath but humble stature. Masses fall upon their knees, to scarce behold my only side. What am I?",
      "answer": "A coin"
    },
    {
      "id": "ultimate-collection-33",
      "riddle": "A blue house has blue bricks; a yellow house has a yellow bricks. What is a green house made of?",
      "answer": "Glass"
    },
    {
      "id": "ultimate-collection-34",
      "riddle": "What do we all put off until tomorrow?",
      "answer": "Our clothes"
    },
    {
      "id": "ultimate-collection-35",
      "riddle": "What type of dress can never be worn?",
      "answer": "Address"
    },
    {
      "id": "ultimate-collection-36",
      "riddle": "What has one eye but cannot see?",
      "answer": "A needle"
    },
    {
      "id": "ultimate-collection-37",
      "riddle": "My father have a grey horse in him yard, ride him nowhere but on him tail.",
      "answer": "Pipe"
    },
    {
      "id": "ultimate-collection-38",
      "riddle": "I'm round at the ends and high in the middle. What am I?",
      "answer": "Ohio"
    },
    {
      "id": "ultimate-collection-39",
      "riddle": "If I have it, I don't share it. If I share it, I don't have it. What is it?",
      "answer": "A Secret"
    },
    {
      "id": "ultimate-collection-40",
      "riddle": "More precious than gold, but cannot be bought, Can never be sold, only earned if it's sought, If it is broken it can still be mended, At birth it can't start nor by death is it ended.",
      "answer": "Friendship"
    },
    {
      "id": "ultimate-collection-41",
      "riddle": "I don't have eyes, but once I did see. Once I had thoughts, but now I'm white and empty.",
      "answer": "Skull"
    },
    {
      "id": "ultimate-collection-42",
      "riddle": "I am a strong as ten men Yet ten men cannot stand me up. What am I?",
      "answer": "Water"
    },
    {
      "id": "ultimate-collection-43",
      "riddle": "I'm where yesterday follows today and tomorrow is in the middle. What am I?",
      "answer": "A dictionary"
    },
    {
      "id": "ultimate-collection-44",
      "riddle": "You will always find me in the past. I can be created in the present, But the future can never taint me. What am I?",
      "answer": "History"
    },
    {
      "id": "ultimate-collection-45",
      "riddle": "What is so delicate that even mentioning it breaks it?",
      "answer": "Silence"
    },
    {
      "id": "ultimate-collection-46",
      "riddle": "I'm a bearer of darkness. I'm feared and often hated. I'm a symbol of the unwanted, An omen that leaves you jaded. Some people can predict my coming, But then you'll forever see Things lurking around corners… Are you sure that it was me?",
      "answer": "Grim"
    },
    {
      "id": "ultimate-collection-47",
      "riddle": "What is it that no man wants, but no man wants to lose?",
      "answer": "A lawsuit"
    },
    {
      "id": "ultimate-collection-48",
      "riddle": "A couple sharing five a piece, Stretching, spreading, loudly meet, We are known to often calm, And yet were better known to harm, To help and build, our team of ten, Connects us to the minds of men. What are we?",
      "answer": "Hands and fingers"
    },
    {
      "id": "ultimate-collection-49",
      "riddle": "Although I'm not an insect, some people found me very difficult to exterminate. They called me something like 'insane priest.' The first half of my name means the same as 'scrape,' & my last three letters are a metal. Who am I?",
      "answer": "I'm Rasputin"
    },
    {
      "id": "ultimate-collection-50",
      "riddle": "What has a head, a tail, is brown, and has no legs?",
      "answer": "A penny"
    },
    {
      "id": "ultimate-collection-51",
      "riddle": "I can be long, or I can be short. I can be grown, and I can be bought. I can be painted, or left bare. I can be round, or square. What am I?",
      "answer": "Your fingernails"
    },
    {
      "id": "ultimate-collection-52",
      "riddle": "It can be cracked, It can be made, It can be told, it can be played. What is it?",
      "answer": "A joke"
    },
    {
      "id": "ultimate-collection-53",
      "riddle": "I only have one entrance, but you can come out with three exits. What am I?",
      "answer": "A blouse"
    },
    {
      "id": "ultimate-collection-54",
      "riddle": "A sugarcane without joints, whose leaves reach heaven.",
      "answer": "Prayer"
    },
    {
      "id": "ultimate-collection-55",
      "riddle": "If a green man lives in a green house, a purple man lives in a purple house, a blue man lives in a blue house, a yellow man lives in a yellow house, a black man lives in a black house. Who lives in a White house?",
      "answer": "The President"
    },
    {
      "id": "ultimate-collection-56",
      "riddle": "I am something that floats. But after a period of time I fall.",
      "answer": "A balloon"
    },
    {
      "id": "ultimate-collection-57",
      "riddle": "I have a thing, which I twine and twine and it is covered.",
      "answer": "Weaving spool"
    },
    {
      "id": "ultimate-collection-58",
      "riddle": "A man in prison has a visitor. Afterward a guard asks the inmate who the visitor was to him. The inmate replies: brothers and sisters I have none, but that man's father is my father's son. Who was the visitor to the inmate?",
      "answer": "His son"
    },
    {
      "id": "ultimate-collection-59",
      "riddle": "My sides are firmly laced about, Yet nothing is within; You'll think my head is strange indeed, Being nothing else but skin.",
      "answer": "A drum"
    },
    {
      "id": "ultimate-collection-60",
      "riddle": "Tool of thief, toy of queen. Always used to be unseen. Sign of joy, sign of sorrow. Giving all likeness borrowed.",
      "answer": "Mask"
    },
    {
      "id": "ultimate-collection-61",
      "riddle": "Why is the math book sad?",
      "answer": "It has problems"
    },
    {
      "id": "ultimate-collection-62",
      "riddle": "I am taken from a mine, and shut up in a wooden case, from which I am never released, and yet I am used by almost everybody.",
      "answer": "Pencil lead"
    },
    {
      "id": "ultimate-collection-63",
      "riddle": "Above the kingdom I reign, Spotted, speckled, with a mane, I travel in packs, And if you're lucky, you'd ride me. What am I?",
      "answer": "Giraffe"
    },
    {
      "id": "ultimate-collection-64",
      "riddle": "I have a thousand wheels, but move I do not. Call me what I am, call me a lot.",
      "answer": "Parking lot"
    },
    {
      "id": "ultimate-collection-65",
      "riddle": "There is a kind of fish that can never swim. What is that?",
      "answer": "Dead fish"
    },
    {
      "id": "ultimate-collection-66",
      "riddle": "Some are quick to take it. Others must be coaxed. Those who choose to take it gain and lose the most.",
      "answer": "Risk"
    },
    {
      "id": "ultimate-collection-67",
      "riddle": "Journey without it and you will never prevail, but if you have too much of it you will surely fail.",
      "answer": "Confidence"
    },
    {
      "id": "ultimate-collection-68",
      "riddle": "What is put on a table, cut, but never eaten?",
      "answer": "Cards"
    },
    {
      "id": "ultimate-collection-69",
      "riddle": "Early ages the iron boot tread, With Europe at her command. Through time power slipped and fled, 'til the creation of new holy land. Who am I?",
      "answer": "Rome Italy"
    },
    {
      "id": "ultimate-collection-70",
      "riddle": "What takes hours to pull off Is most satisfying when it's done And requires consent from the person you're doing it to?",
      "answer": "Hypnotism"
    },
    {
      "id": "ultimate-collection-71",
      "riddle": "What English word retains the same pronunciation, even after you take away four of its five letters?",
      "answer": "Queue"
    },
    {
      "id": "ultimate-collection-72",
      "riddle": "People buy me to eat, but never eat me. What am I?",
      "answer": "A plate"
    },
    {
      "id": "ultimate-collection-73",
      "riddle": "With head without hair. With mouth without tooth.",
      "answer": "A bottle"
    },
    {
      "id": "ultimate-collection-74",
      "riddle": "I cannot be other than what I am, Until the man who made me dies, Power and glory will fall to me finally, Only when he last closes his eyes.",
      "answer": "A prince"
    },
    {
      "id": "ultimate-collection-75",
      "riddle": "A way to say boring, minus the dane. Scat. Use, minus the e. Who am I?",
      "answer": "Mundugus"
    },
    {
      "id": "ultimate-collection-76",
      "riddle": "What always goes to bed with its shoes on?",
      "answer": "A horse"
    },
    {
      "id": "ultimate-collection-77",
      "riddle": "Lovely and round, I shine with pale light, Grown in the darkness, a lady's delight.",
      "answer": "Pearl"
    },
    {
      "id": "ultimate-collection-78",
      "riddle": "We travel much, yet prisoners are, and close confined to boot. Yet with any horse, we will keep the pace, and will always go on foot. What are they?",
      "answer": "Spurs"
    },
    {
      "id": "ultimate-collection-79",
      "riddle": "Black we are and much admired, Men seek us if they are tired, We tire the horse, comfort man, Guess this riddle if you can.",
      "answer": "Coal"
    },
    {
      "id": "ultimate-collection-80",
      "riddle": "I can be as thin as a picture frame but my insides have many things you can see.",
      "answer": "Television"
    },
    {
      "id": "ultimate-collection-81",
      "riddle": "Samuel was out for a walk and it started to rain. He did not have an umbrella and he wasn't wearing a hat. His clothes were soaked, yet not a single hair on his head got wet. How could this be?",
      "answer": "Samuel was bald"
    },
    {
      "id": "ultimate-collection-82",
      "riddle": "I have an eye but cannot see. I'm faster than any man alive and have no limbs. What am I?",
      "answer": "A hurricane"
    },
    {
      "id": "ultimate-collection-83",
      "riddle": "I come in many colors, some are blue and white. While some people annoy me, I am not much for the fight. I live where people rarely tread, but you will find me close to bed. What am I?",
      "answer": "Whales"
    },
    {
      "id": "ultimate-collection-84",
      "riddle": "Round as an apple, deep as a cup, and all the kings' horses can't fill it up. What is it?",
      "answer": "A well"
    },
    {
      "id": "ultimate-collection-85",
      "riddle": "As I went through the garden gap, Who should I meet but Dick Red-cap! A stick in his hand, a stone in his throat, If you'll tell me this riddle, I'll give you a groat.",
      "answer": "A cherry"
    },
    {
      "id": "ultimate-collection-86",
      "riddle": "A man stands outside in the rain. He has no hat, raincoat, or umbrella. His clothes are soaked, but his hair isn't wet. How is this possible?",
      "answer": "Heisbald"
    },
    {
      "id": "ultimate-collection-87",
      "riddle": "I have hands that wave you, though I never say goodbye. It's cool for you to be with me, especially when I say HI. What am I?",
      "answer": "An electric fan"
    },
    {
      "id": "ultimate-collection-88",
      "riddle": "What has a big mouth, yet never speaks?",
      "answer": "A jar"
    },
    {
      "id": "ultimate-collection-89",
      "riddle": "I have a pet, his body is full of coins",
      "answer": "A piggy bank"
    },
    {
      "id": "ultimate-collection-90",
      "riddle": "Everyone has me but nobody can lose me. What am I?",
      "answer": "A shadow"
    },
    {
      "id": "ultimate-collection-91",
      "riddle": "What is lengthened by being cut at both ends?",
      "answer": "A ditch"
    },
    {
      "id": "ultimate-collection-92",
      "riddle": "I dig out tiny caves, and store gold and silver in them. I also build bridges of silver and make crowns of gold. They are the smallest you could imagine. Sooner or later everybody needs my help, yet many people are afraid to let me help them. Who am I?",
      "answer": "Dentist"
    },
    {
      "id": "ultimate-collection-93",
      "riddle": "In the night a mountain in the morning a meadow. What am I?",
      "answer": "A bed"
    },
    {
      "id": "ultimate-collection-94",
      "riddle": "A mile from end to end, yet as close to as a friend. A precious commodity, freely given. Found on the rich, poor, short and tall, but shared among children most of all. What is it?",
      "answer": "A smile"
    },
    {
      "id": "ultimate-collection-95",
      "riddle": "I have seven letters and am something you eat. My only anagram can help your pain. If you remove my first 2 letters I wear things down. Removing my first 3 letters is an adjective and removing my first 4 letters leaves a measure of time. What am I?",
      "answer": "Sausage"
    },
    {
      "id": "ultimate-collection-96",
      "riddle": "If I say, \"Everything I tell you is a lie\", am I telling you the truth or a lie?",
      "answer": "Paradox"
    },
    {
      "id": "ultimate-collection-97",
      "riddle": "A grain of rice that occupies the entire house",
      "answer": "Light bulb"
    },
    {
      "id": "ultimate-collection-98",
      "riddle": "Squishes, Squashes, Wishes I washes, Can get it in my hair, Makes me not look too fair.",
      "answer": "Mud"
    },
    {
      "id": "ultimate-collection-99",
      "riddle": "Can you think of a crime that is punishable if attempted but not punishable is actually committed?",
      "answer": "Suicide"
    },
    {
      "id": "ultimate-collection-100",
      "riddle": "Which bird in this world flies yet suckles its young?",
      "answer": "Fruit bat"
    },
    {
      "id": "ultimate-collection-101",
      "riddle": "What lies in bed, and stands in bed? First white then red. The plumper it gets the better the old women like it?",
      "answer": "A strawberry"
    },
    {
      "id": "ultimate-collection-102",
      "riddle": "There is bomb on top of a computer; around the computer are a hairbrush, keys, phone and a cup. When the explosion comes, what item destroyed first?",
      "answer": "The bomb"
    },
    {
      "id": "ultimate-collection-103",
      "riddle": "In the sky it roams, As a dark cloud in the sky, Yet much faster, And not when nearby.",
      "answer": "Swarm of birds"
    },
    {
      "id": "ultimate-collection-104",
      "riddle": "I have Eighty-eight keys but cannot open a single door? What am I?",
      "answer": "A piano"
    },
    {
      "id": "ultimate-collection-105",
      "riddle": "What's that 7 letter word with thousands of letters in it?",
      "answer": "A mailbox"
    },
    {
      "id": "ultimate-collection-106",
      "riddle": "What makes a loud noise when changing its jacket, becomes larger but weighs less?",
      "answer": "Popcorn"
    },
    {
      "id": "ultimate-collection-107",
      "riddle": "If you eat me, my sender will eat you. What am I?",
      "answer": "A fishhook"
    },
    {
      "id": "ultimate-collection-108",
      "riddle": "I have no brain but am still smarter than the average human. What am I?",
      "answer": "Calculator"
    },
    {
      "id": "ultimate-collection-109",
      "riddle": "When pronounced, it sounds nothing like the word.",
      "answer": "A sentence"
    },
    {
      "id": "ultimate-collection-110",
      "riddle": "What grows in winter, dies in summer, and grows roots upward?",
      "answer": "An icicle"
    },
    {
      "id": "ultimate-collection-111",
      "riddle": "Whoever makes it, tells it not. Whoever takes it, knows it not. Whoever knows it, wants it not. What is it?",
      "answer": "Counterfeit money"
    },
    {
      "id": "ultimate-collection-112",
      "riddle": "A hill full, a hole full; yet you cannot catch a bowl full. What is it?",
      "answer": "A mist"
    },
    {
      "id": "ultimate-collection-113",
      "riddle": "I'm not the sort that's eaten, I'm not the sort you bake, Don't put me in an oven; I don't taste that great, But when applied correctly, around me you will find, Problems are so simple when my digits come to mind.",
      "answer": "Pi (3.14)"
    },
    {
      "id": "ultimate-collection-114",
      "riddle": "What has 4 eyes but can't see.",
      "answer": "Mississippi"
    },
    {
      "id": "ultimate-collection-115",
      "riddle": "I don't exist unless you cut me, but if you stab me I won't bleed. I hate no one yet am abhorred by all. What am I?",
      "answer": "A fart"
    },
    {
      "id": "ultimate-collection-116",
      "riddle": "I have many ears, this may be true But no matter how you shout, I'll never hear you. What am I?",
      "answer": "Cornfield"
    },
    {
      "id": "ultimate-collection-117",
      "riddle": "A father's child, a mother's child, yet no one's son.",
      "answer": "Daughter"
    },
    {
      "id": "ultimate-collection-118",
      "riddle": "A leathery snake, With a stinging bite, I'll stay coiled up, Unless I must fight.",
      "answer": "A whip"
    },
    {
      "id": "ultimate-collection-119",
      "riddle": "With me you are blind, To others and what they are, Over me you cannot see, Even though I'm in your head, I am full of myself, I think I'm better than you, I'm a horrible thing to be, Can you tell me, What am I?",
      "answer": "Ignorance"
    },
    {
      "id": "ultimate-collection-120",
      "riddle": "What jumps when it walks and sits when it stands?",
      "answer": "A kangaroo"
    },
    {
      "id": "ultimate-collection-121",
      "riddle": "Never ahead, ever behind, Yet flying swiftly past; For a child I last forever, For adults I'm gone too fast.",
      "answer": "Childhood"
    },
    {
      "id": "ultimate-collection-122",
      "riddle": "What has wings, but can not fly. Is enclosed, but can outside also lie. Can open itself up, Or close itself away. Is the place of kings and queens, And doggerel of every means. What is it upon which I stand? Which can lead us to different lands.",
      "answer": "A stage"
    },
    {
      "id": "ultimate-collection-123",
      "riddle": "Without a bridle, or a saddle, across a thing I ride a-straddle. And those I ride, by help of me, though almost blind, are made to see. What am I?",
      "answer": "Spectacles"
    },
    {
      "id": "ultimate-collection-124",
      "riddle": "What gets whiter the dirtier that it gets?",
      "answer": "A chalkboard"
    },
    {
      "id": "ultimate-collection-125",
      "riddle": "I have a mouth on my head and eat everything. What am I?",
      "answer": "A backpack"
    },
    {
      "id": "ultimate-collection-126",
      "riddle": "What do people want the least on their hands?",
      "answer": "Handcuffs"
    },
    {
      "id": "ultimate-collection-127",
      "riddle": "First you see me in the grass dressed in yellow gay; next I am in dainty white, then I fly away. What am I?",
      "answer": "A dandelion"
    },
    {
      "id": "ultimate-collection-128",
      "riddle": "What goes in the water black and comes out red?",
      "answer": "A lobster"
    },
    {
      "id": "ultimate-collection-129",
      "riddle": "Thousands of these come together to make a digital image. What is it?",
      "answer": "Pixel"
    },
    {
      "id": "ultimate-collection-130",
      "riddle": "What English word has three consecutive double letters?",
      "answer": "Bookkeeper"
    },
    {
      "id": "ultimate-collection-131",
      "riddle": "We are five little objects of an everyday sort, You will find us all in a tennis court.",
      "answer": "Vowels"
    },
    {
      "id": "ultimate-collection-132",
      "riddle": "Sometimes I am light, sometimes I am dark. What am I?",
      "answer": "Chocolate"
    },
    {
      "id": "ultimate-collection-133",
      "riddle": "A three-letter word I'm sure you know, I can be on a boat or a sleigh in the snow, I'm pals with the rain and honor a king, But my favorite use is attached to a string. What am I?",
      "answer": "A bow"
    },
    {
      "id": "ultimate-collection-134",
      "riddle": "Twigs but no roots leaves but no shoots; Faring forever over the sand. Filmmakers love me But ranchers, they hate me. I came here from Russia Isn't life grand?",
      "answer": "Russian Thistle"
    },
    {
      "id": "ultimate-collection-135",
      "riddle": "I never ask questions, but always answered. What am I?",
      "answer": "A doorbell"
    },
    {
      "id": "ultimate-collection-136",
      "riddle": "When the creeper passes, all the grass kneels.",
      "answer": "Plow"
    },
    {
      "id": "ultimate-collection-137",
      "riddle": "Your reflection can be seen here, as long as you're not moving.",
      "answer": "Water"
    },
    {
      "id": "ultimate-collection-138",
      "riddle": "What type of house weighs the least?",
      "answer": "A lighthouse"
    },
    {
      "id": "ultimate-collection-139",
      "riddle": "Of these things - I have two. One for me - and one for you. And when you ask about the price, I simply smile and nod twice.",
      "answer": "Sharing"
    },
    {
      "id": "ultimate-collection-140",
      "riddle": "Though I should be unique, you've made most of us the same. I would be stronger, if my characters were stranger.",
      "answer": "A password"
    },
    {
      "id": "ultimate-collection-141",
      "riddle": "Big as a biscuit, deep as a cup, but even a river can't fill it up. What is it?",
      "answer": "A strainer"
    },
    {
      "id": "ultimate-collection-142",
      "riddle": "I ate one and threw away two.",
      "answer": "Oyster"
    },
    {
      "id": "ultimate-collection-143",
      "riddle": "A harvest sown and reaped on the same day In an unplowed field, Which increases without growing, Remains whole though it is eaten Within and without, Is useless and yet The staple of nations.",
      "answer": "War"
    },
    {
      "id": "ultimate-collection-144",
      "riddle": "A long snake that smokes. What am I?",
      "answer": "Train"
    },
    {
      "id": "ultimate-collection-145",
      "riddle": "How many months have 28 days?",
      "answer": "All of them"
    },
    {
      "id": "ultimate-collection-146",
      "riddle": "Who is it that rows quickly with four oars but never comes out under his own roof?",
      "answer": "Turtle"
    },
    {
      "id": "ultimate-collection-147",
      "riddle": "My first is 3 letters, the mixed around, to make a different, new kind of sound. My second is a word often used to describe something that has an amazing vibe. My third is a number, that part is true. It comes right after zero and right before two. Who am I?",
      "answer": "Wonderful"
    },
    {
      "id": "ultimate-collection-148",
      "riddle": "I grow for a surface, even if you cut me. I continue to grow even after death.",
      "answer": "Hair"
    },
    {
      "id": "ultimate-collection-149",
      "riddle": "I am not alive but I grow. I don't have lungs but I need air. What am i?",
      "answer": "Fire"
    },
    {
      "id": "ultimate-collection-150",
      "riddle": "Not a priest, not a king but wears different kinds of clothes.",
      "answer": "Clothesline"
    },
    {
      "id": "ultimate-collection-151",
      "riddle": "Blend a teapot shot so the pearlies won't rot!",
      "answer": "Toothpaste"
    },
    {
      "id": "ultimate-collection-152",
      "riddle": "Walk on the living, they don't even mumble. Walk on the dead, they mutter and grumble",
      "answer": "Leaves"
    },
    {
      "id": "ultimate-collection-153",
      "riddle": "Today he is there to trip you up and he will torture you tomorrow.",
      "answer": "Homework"
    },
    {
      "id": "ultimate-collection-154",
      "riddle": "The more you take the more you leave behind.",
      "answer": "Footsteps"
    },
    {
      "id": "ultimate-collection-155",
      "riddle": "Oh how I love my dancing feet! They stay together - oh so neat. And when I want to walk a line, They all stay together and do double time. I count them up, ten times or more, And race on-off, across the floor.",
      "answer": "Centipede"
    },
    {
      "id": "ultimate-collection-156",
      "riddle": "What heavy seven letter word can you take two away from and be left with eight?",
      "answer": "Weights"
    },
    {
      "id": "ultimate-collection-157",
      "riddle": "You use a knife to slice my head and weep beside me when I am dead. What am I?",
      "answer": "Onion"
    },
    {
      "id": "ultimate-collection-158",
      "riddle": "Ne'er the same, In multitude you see me. You love me, you hate me, What am I? What am I?",
      "answer": "People"
    },
    {
      "id": "ultimate-collection-159",
      "riddle": "Shorter than my four siblings, but easily the strongest, Sometimes I wear a funny hat.",
      "answer": "Thumb"
    },
    {
      "id": "ultimate-collection-160",
      "riddle": "I have joy in bringing two together, but darning my existence! My life hangs by a thread, filled with ups, downs and resistance!",
      "answer": "Needle"
    },
    {
      "id": "ultimate-collection-161",
      "riddle": "What has ten letters and starts with gas?",
      "answer": "Automobile"
    },
    {
      "id": "ultimate-collection-162",
      "riddle": "Looks like water, but it's heat. Sits on sand, lays on concrete. People have been known, To follow it everywhere. But it gets them no place, And all they can do is stare.",
      "answer": "Mirage"
    },
    {
      "id": "ultimate-collection-163",
      "riddle": "Flour of England, fruit of Spain, Met together in a shower of rain; Put in a bag tied round with a string, If you'll tell me this riddle, I'll give you a ring.",
      "answer": "Plum pudding"
    },
    {
      "id": "ultimate-collection-164",
      "riddle": "What is it something that you always have but you always leave behind?",
      "answer": "Fingerprints"
    },
    {
      "id": "ultimate-collection-165",
      "riddle": "In my place, I am the figure of authority. I housed evil unknowingly. I gave it away to instruction which soon led to the world's destruction. What is my last name?",
      "answer": "Pandora"
    },
    {
      "id": "ultimate-collection-166",
      "riddle": "Wednesday, Tom and Joe went to a restaurant and ate dinner. When they were done they paid for the food and left. But Tom and Joe didn't pay for the food. Who did?",
      "answer": "Wednesday"
    },
    {
      "id": "ultimate-collection-167",
      "riddle": "What does an old tan broken down house wear outside?",
      "answer": "Address"
    },
    {
      "id": "ultimate-collection-168",
      "riddle": "Everyone has it. Those who have it least don't know that they have it. Those who have it most wish they had less of it, But not too little or none at all.",
      "answer": "Age"
    },
    {
      "id": "ultimate-collection-169",
      "riddle": "Hickory-Dickory-Dock! The mouse ran up the clock. The clock struck one, And down did come. Hickory-Dickory-Dock! What am I?",
      "answer": "Mouse"
    },
    {
      "id": "ultimate-collection-170",
      "riddle": "What goes through a door but never goes in and never comes out?",
      "answer": "Keyhole"
    },
    {
      "id": "ultimate-collection-171",
      "riddle": "On the wall, in the air, You just want me out of your hair, Try to catch me, but you cannot, For my vision is thousand fold. What am I?",
      "answer": "Fly"
    },
    {
      "id": "ultimate-collection-172",
      "riddle": "Iron roof, glass walls, burns and burns and never falls.",
      "answer": "Lantern"
    },
    {
      "id": "ultimate-collection-173",
      "riddle": "We hurt without moving. We poison without touching. We bear the truth and the lies. We are not to be judged by our size. What are we?",
      "answer": "Words"
    },
    {
      "id": "ultimate-collection-174",
      "riddle": "I can bring tears to your eyes; resurrect the dead, make you smile, and reverse time. I form in an instant but I last a lifetime. What am I?",
      "answer": "Memory"
    },
    {
      "id": "ultimate-collection-175",
      "riddle": "Slayer of regrets, old and new, sought by many, found by few.",
      "answer": "Redemption"
    },
    {
      "id": "ultimate-collection-176",
      "riddle": "You use me for multiple reasons, I am many colored, and many shaped. I may or may not also tell you your sexual preference. What am I?",
      "answer": "Flag"
    },
    {
      "id": "ultimate-collection-177",
      "riddle": "I build up castles. I tear down mountains. I make some men blind, I help others to see. What am I?",
      "answer": "Sand"
    },
    {
      "id": "ultimate-collection-178",
      "riddle": "All day long it's in and out. I discharge loads from my shaft. Both men and women go down on me. What am I?",
      "answer": "Elevator"
    },
    {
      "id": "ultimate-collection-179",
      "riddle": "Two birds, trying to balance in one twig.",
      "answer": "Earrings"
    },
    {
      "id": "ultimate-collection-180",
      "riddle": "Thousands lay up gold within this house, But no man made it. Spears past counting guard this house, But no man wards it.",
      "answer": "Beehive"
    },
    {
      "id": "ultimate-collection-181",
      "riddle": "I have one eye, See near and far, I hold the moments you treasure, And the things that make you weep.",
      "answer": "Camera"
    },
    {
      "id": "ultimate-collection-182",
      "riddle": "When it was young, it had a tail. When it grew up, it had knees.",
      "answer": "Frog"
    },
    {
      "id": "ultimate-collection-183",
      "riddle": "You'll have me at night and if you remove the first letter I denote the top, such as on a train.",
      "answer": "Car"
    },
    {
      "id": "ultimate-collection-184",
      "riddle": "Kills the bad ones and the sad ones. Tightens to fit, so one size fits.",
      "answer": "Noose"
    },
    {
      "id": "ultimate-collection-185",
      "riddle": "Big Square Bag of Mr. Jacob, to use it, you have to turn it upside down.",
      "answer": "Pocket"
    },
    {
      "id": "ultimate-collection-186",
      "riddle": "Stars awash in a sheen of light, It calls out loud in vile delight. Listeners endure in fright. Vicious brute that reigns at night, Evil whelped of heinous bite, Renewed by wax, it regains might. A leading way to slay the beast, Get the hidden weapon thus released. What is this describing?",
      "answer": "Vampire"
    },
    {
      "id": "ultimate-collection-187",
      "riddle": "What can you throw but not catch?",
      "answer": "A party"
    },
    {
      "id": "ultimate-collection-188",
      "riddle": "What does a turkey do when he flies upside down?",
      "answer": "Gobbles up"
    },
    {
      "id": "ultimate-collection-189",
      "riddle": "What goes in the water red, and comes out black?",
      "answer": "Iron"
    },
    {
      "id": "ultimate-collection-190",
      "riddle": "What's as small as a mouse but guards a house like a lion?",
      "answer": "Lock"
    },
    {
      "id": "ultimate-collection-191",
      "riddle": "If a chicken says, all chickens are liars is the chicken telling the truth?",
      "answer": "Paradox"
    },
    {
      "id": "ultimate-collection-192",
      "riddle": "Fear of what I would become haunted my blood. Both can be seen as a curse Though one is much much worse. It was the luck of the draw, you can say, That I came out this way. So, I guess, with my changing physique, I can be seen as quite unique. Who am I?",
      "answer": "Werewolf"
    },
    {
      "id": "ultimate-collection-193",
      "riddle": "Begotten, and Born, and dying with Noise, The Terror of Women, and Pleasure of Boys, Like the Fiction of Poets concerning the Wind, I'm chiefly unruly, when strongest confined.",
      "answer": "Fart"
    },
    {
      "id": "ultimate-collection-194",
      "riddle": "Sharp and long, flag of the world.",
      "answer": "Thorn"
    },
    {
      "id": "ultimate-collection-195",
      "riddle": "What is something to everybody and nothing to everyone else?",
      "answer": "Mind"
    },
    {
      "id": "ultimate-collection-196",
      "riddle": "What has a foot but no leg?",
      "answer": "Ruler"
    },
    {
      "id": "ultimate-collection-197",
      "riddle": "You can't see, you can't touch, and yet you were fascinated by me.",
      "answer": "Story"
    },
    {
      "id": "ultimate-collection-198",
      "riddle": "Within, I clean all that is bad and is old. I make juice that's the color of gold. Should I die, a filter machine would you need assembled to replace me and beans I resemble.",
      "answer": "Kidney"
    },
    {
      "id": "ultimate-collection-199",
      "riddle": "I am a seed, three letters in the name, Take away two and I sound quite the same. What am I?",
      "answer": "Pea"
    },
    {
      "id": "ultimate-collection-200",
      "riddle": "What is never used unless it's in a tight place?",
      "answer": "Cork"
    },
    {
      "id": "ultimate-collection-201",
      "riddle": "Thirty white horses on a red hill, First they champ, Then they stamp, Then they stand still.",
      "answer": "Teeth"
    },
    {
      "id": "ultimate-collection-202",
      "riddle": "I can turn into a car, building or even a robot. I'm man made and my siblings and I outnumber you sixty-two to one. My name means, Play well in my creator's native tongue. What am I?",
      "answer": "Lego"
    },
    {
      "id": "ultimate-collection-203",
      "riddle": "What has feet and legs and nothing else?",
      "answer": "Stockings"
    },
    {
      "id": "ultimate-collection-204",
      "riddle": "The virgin gave birth to a child and threw away the blanket.",
      "answer": "Banana"
    },
    {
      "id": "ultimate-collection-205",
      "riddle": "You can only have it once you have given it.",
      "answer": "Respect"
    },
    {
      "id": "ultimate-collection-206",
      "riddle": "Many have heard me, but nobody has seen me, and I will not speak back until spoken to. What am I?",
      "answer": "Echo"
    },
    {
      "id": "ultimate-collection-207",
      "riddle": "Although my cow is dead, I still beat her. What a racket she makes!",
      "answer": "Drum"
    },
    {
      "id": "ultimate-collection-208",
      "riddle": "What asks but never answers?",
      "answer": "Owl"
    },
    {
      "id": "ultimate-collection-209",
      "riddle": "I went to the woods and got it, when I got it didn't want it, looked for it, couldn't find it so I took it home.",
      "answer": "Splinter"
    },
    {
      "id": "ultimate-collection-210",
      "riddle": "What always ends everything?",
      "answer": "The letter G"
    },
    {
      "id": "ultimate-collection-211",
      "riddle": "What goes \"oh oh oh\"?",
      "answer": "Santa walking backwards"
    },
    {
      "id": "ultimate-collection-212",
      "riddle": "A dad and his four boys stand in line. All crowned, they toil in darkness. Another family they see, two birds of a feather. All of them together clad in leather.",
      "answer": "Hand in glove"
    },
    {
      "id": "ultimate-collection-213",
      "riddle": "I'm a gift that you'll hate. I'm tough to create. With my emblem, you'll be distinguished As a clan of blood-pride extinguished.",
      "answer": "Coat of arms"
    },
    {
      "id": "ultimate-collection-214",
      "riddle": "What falls but never breaks and breaks but never falls?",
      "answer": "Night and day"
    },
    {
      "id": "ultimate-collection-215",
      "riddle": "I start at the finish and finish on the start. How?",
      "answer": "Racetrack"
    },
    {
      "id": "ultimate-collection-216",
      "riddle": "I'm so simple I only point, Yet I guide people all over the world. What am I?",
      "answer": "Compass"
    },
    {
      "id": "ultimate-collection-217",
      "riddle": "Armless, legless, I crawl around when I'm young. Then the time of changing sleep will come. I will awake like a newborn, flying beast, 'till then on the remains of the dead I feast.",
      "answer": "Maggot"
    },
    {
      "id": "ultimate-collection-218",
      "riddle": "I am used for many things like war and destruction, yet also in speech. What am I?",
      "answer": "Tongue"
    },
    {
      "id": "ultimate-collection-219",
      "riddle": "I sit in parliament. You'll only see me at night... What am I?",
      "answer": "Owl"
    },
    {
      "id": "ultimate-collection-220",
      "riddle": "A tree with 5 branches, no leaves and no fruits.",
      "answer": "Hand"
    },
    {
      "id": "ultimate-collection-221",
      "riddle": "My step is slow, the snow's my breath I give the ground, a grinding death My marching makes an end of me Slain by sun or drowned in sea.",
      "answer": "Glacier"
    },
    {
      "id": "ultimate-collection-222",
      "riddle": "I am one of many, You forget I'm here, but I'm just below. Without me, you'd surely topple, Go ahead, what am I?",
      "answer": "Toe"
    },
    {
      "id": "ultimate-collection-223",
      "riddle": "I go in dry and come out wet, The longer I'm in, the stronger I get. What am I?",
      "answer": "Teabag"
    },
    {
      "id": "ultimate-collection-224",
      "riddle": "What's the difference between a well-dressed man on a bicycle and a poorly-dressed man on a tricycle?",
      "answer": "Attire"
    },
    {
      "id": "ultimate-collection-225",
      "riddle": "I am born in fear, raised in truth, And I come to my own in deed. When comes a time that I'm called forth, I come to serve the cause of need.",
      "answer": "Courage"
    },
    {
      "id": "ultimate-collection-226",
      "riddle": "With pointed fangs it sits in wait, With piercing force it doles out fate, Over bloodless victims proclaiming its might, Eternally joining in a single bite What is it?",
      "answer": "Stapler"
    },
    {
      "id": "ultimate-collection-227",
      "riddle": "What is all over a house?",
      "answer": "Roof"
    },
    {
      "id": "ultimate-collection-228",
      "riddle": "Name any word that becomes shorter even when you add 2 more letters to it?",
      "answer": "Short"
    },
    {
      "id": "ultimate-collection-229",
      "riddle": "Forever trapped, I have no choice, It is the curse of this life, Just for others like me, Though, if you wander across a kind soul, You may receive a special gift Which will set you free What am I?",
      "answer": "Genie"
    },
    {
      "id": "ultimate-collection-230",
      "riddle": "I saw a man in white, he looked quite a sight. He was not old, but he stood in the cold. And when he felt the sun, he started to run. Who could he be? Please answer me.",
      "answer": "Snowman"
    },
    {
      "id": "ultimate-collection-231",
      "riddle": "My first is in wield, sever bones and marrow. My second is in blade, forged in cold steel. My third is in arbalest, and also in arrows. My fourth is in power, plunged through a shield. My fifth is in honor, and also in vows My last will put an end to it all.",
      "answer": "Weapon"
    },
    {
      "id": "ultimate-collection-232",
      "riddle": "Not born, but from a Mother's body drawn, I hang until half of me is gone. I sleep in a cave until I grow old, then valued for my hardened gold. What am I?",
      "answer": "Cheese"
    },
    {
      "id": "ultimate-collection-233",
      "riddle": "The captain took a bath without his belly getting wet.",
      "answer": "Boat"
    },
    {
      "id": "ultimate-collection-234",
      "riddle": "What kind of room doesn't have physical walls?",
      "answer": "Mushroom"
    },
    {
      "id": "ultimate-collection-235",
      "riddle": "I have no life, but I can die, what am I?",
      "answer": "Battery"
    },
    {
      "id": "ultimate-collection-236",
      "riddle": "April showers bring May flowers. What do May flowers bring?",
      "answer": "Pilgrims"
    },
    {
      "id": "ultimate-collection-237",
      "riddle": "Break it and it is better, immediately set and harder to break again.",
      "answer": "Record"
    },
    {
      "id": "ultimate-collection-238",
      "riddle": "If you have me, you want to tell me. If you tell me, you don't have me.",
      "answer": "Secret"
    },
    {
      "id": "ultimate-collection-239",
      "riddle": "Born of sorrow, grows with age, You need a lot to be a sage. What is it?",
      "answer": "Wisdom"
    },
    {
      "id": "ultimate-collection-240",
      "riddle": "There are two meanings to me. With one I may need to be broken, with the other I hold on. My favorite characteristic is my charming dimple. What am I?",
      "answer": "Tie"
    },
    {
      "id": "ultimate-collection-241",
      "riddle": "You can easily touch me, but not see me. You can throw me out, but not away. What am I?",
      "answer": "Your back"
    },
    {
      "id": "ultimate-collection-242",
      "riddle": "If you live in an 11-floor house and everything is green, the house, blender, toilet, elevator, ribbon, couch, computer, plates, food! You get to the 6th floor and there are no more stairs how did you get to the 11th floor?",
      "answer": "Green elevator"
    },
    {
      "id": "ultimate-collection-243",
      "riddle": "To unravel me, you need a key. No key that was made by locksmith's hand, but a key that only I will understand. What am I?",
      "answer": "Cipher"
    },
    {
      "id": "ultimate-collection-244",
      "riddle": "As beautiful as the setting sun, As delicate as the morning dew; An angel's dusting from the stars, That can turn the Earth into a frosted moon. What am I?",
      "answer": "Snow"
    },
    {
      "id": "ultimate-collection-245",
      "riddle": "There is a word in the English language in which the first two letters signify a male, the first three letters signify a female, the first four signify a great man, and the whole word, a great woman. What is the word?",
      "answer": "Heroine"
    },
    {
      "id": "ultimate-collection-246",
      "riddle": "The shorter I am, the bigger I am. What am I?",
      "answer": "Temper"
    },
    {
      "id": "ultimate-collection-247",
      "riddle": "Air that is expelled orally.",
      "answer": "Breath"
    },
    {
      "id": "ultimate-collection-248",
      "riddle": "I am made from an animal, Although you nickname me after a different one. You can't eat me; you can only hold me, And once a year a festival is erected in my honor. What am I? I am made from an animal,",
      "answer": "Pigskin"
    },
    {
      "id": "ultimate-collection-249",
      "riddle": "The sun bakes them, the hand breaks them, the foot treads on them, and the mouth tastes them. What are they?",
      "answer": "Grapes"
    },
    {
      "id": "ultimate-collection-250",
      "riddle": "What is a Mummy's favorite type of music?",
      "answer": "Wrap"
    },
    {
      "id": "ultimate-collection-251",
      "riddle": "I can sizzle like bacon, I am made with an egg, I have plenty of backbone, but lack a good leg. I peel layers like onions, but still remain whole. I can be long like a flagpole, yet fit in a hole. What am I?",
      "answer": "Snake"
    },
    {
      "id": "ultimate-collection-252",
      "riddle": "I'm lighter than air but a million men can't lift me. What am I?",
      "answer": "Bubble"
    },
    {
      "id": "ultimate-collection-253",
      "riddle": "The sharp slim blade, that cuts the wind. What is it?",
      "answer": "Grass"
    },
    {
      "id": "ultimate-collection-254",
      "riddle": "What do thief's get for stealing calendars?",
      "answer": "12 months"
    },
    {
      "id": "ultimate-collection-255",
      "riddle": "Until I am measured, I am not known. Yet how you miss me when I have flown. What am I?",
      "answer": "Time"
    },
    {
      "id": "ultimate-collection-256",
      "riddle": "What has a coat? Hugs you not in sympathy? Whose smile you'd rather not see? Whose stance is a terrible thing to see? Who is it that brave men run away from? Whose fingers are clawed? Whose sleep lasts for months? And who's company we shunt?",
      "answer": "Bear"
    },
    {
      "id": "ultimate-collection-257",
      "riddle": "A woman who lives in New York legally married three men. She didn't get divorce, get an annulment or legally separated. How is this possible?",
      "answer": "She's a minister"
    },
    {
      "id": "ultimate-collection-258",
      "riddle": "I cut through evil Like a double edged sword, And chaos flees at my approach. Balance I single-handedly upraise, Through battles fought with heart and mind, Instead of with my gaze. What am I?",
      "answer": "Justice"
    },
    {
      "id": "ultimate-collection-259",
      "riddle": "What can travel around the world while staying in a corner?",
      "answer": "Stamp"
    },
    {
      "id": "ultimate-collection-260",
      "riddle": "I defend without weapons, stand without legs, wound without force, and am harder to fight than to kill. What am I?",
      "answer": "Lies"
    },
    {
      "id": "ultimate-collection-261",
      "riddle": "I have a leg but I do not move, A face but no expression, Be it wind or rain I stay outside. What am I?",
      "answer": "Scarecrow"
    },
    {
      "id": "ultimate-collection-262",
      "riddle": "Which side of a cat has the most fur?",
      "answer": "Outside"
    },
    {
      "id": "ultimate-collection-263",
      "riddle": "What kind of room has no doors or windows?",
      "answer": "Mushroom"
    },
    {
      "id": "ultimate-collection-264",
      "riddle": "I have a hundred legs but cannot stand, a long neck but no head; I eat the maid's life. What am I?",
      "answer": "Broom"
    },
    {
      "id": "ultimate-collection-265",
      "riddle": "The word CANDY can be spelled using just 2 letters. Can you figure out how?",
      "answer": "C and Y"
    },
    {
      "id": "ultimate-collection-266",
      "riddle": "You may always chase me but you are always about 3 miles away. What am I?",
      "answer": "Horizon"
    },
    {
      "id": "ultimate-collection-267",
      "riddle": "I look flat, but I am deep, Hidden realms I shelter. Lives I take, but food I offer. At times I am beautiful. I can be calm, angry and turbulent. I have no heart, but offer pleasure as well as death. No man can own me, yet I encompass what all men must have.",
      "answer": "Ocean"
    },
    {
      "id": "ultimate-collection-268",
      "riddle": "Many shapes, many sizes. Can't be seen, only felt. I bring pain, I bring joy, I bring laughter, I bring happiness. I can tear the mightiest from their thrones, and those who have me are rich. What am I?",
      "answer": "Emotion"
    },
    {
      "id": "ultimate-collection-269",
      "riddle": "They can be harbored, but few hold water, You can nurse them, but only by holding them against someone else, You can carry them, but not with your arms, You can bury them, but not in the earth.",
      "answer": "Grudges"
    },
    {
      "id": "ultimate-collection-270",
      "riddle": "Anna brings her; she brings Anna, with her wherever she goes.",
      "answer": "Banana"
    },
    {
      "id": "ultimate-collection-271",
      "riddle": "I bind it and it walks. I loose it and it stops.",
      "answer": "Sandal"
    },
    {
      "id": "ultimate-collection-272",
      "riddle": "It has a long neck, A name of a bird, Feeds on cargo of ships, It's not alive,",
      "answer": "Crane"
    },
    {
      "id": "ultimate-collection-273",
      "riddle": "Downward grows the root. Outward grows the skin. Upward grows the shoot. What way blows the wind?",
      "answer": "Nowhere"
    },
    {
      "id": "ultimate-collection-274",
      "riddle": "What loses its head every morning only to get it back every night?",
      "answer": "Pillow"
    },
    {
      "id": "ultimate-collection-275",
      "riddle": "I have 10 fingers and 10 toes, I have 2 eyes a mouth and nose, I'll always be beside you through thick and thin, Not through body, but through my spirit within. What am I?",
      "answer": "Doll"
    },
    {
      "id": "ultimate-collection-276",
      "riddle": "I have a tongue, but cannot speak. I have a bed but cannot sleep. I have four legs but cannot walk. Yet I move as you do. What am I?",
      "answer": "Wagon"
    },
    {
      "id": "ultimate-collection-277",
      "riddle": "I fall with the waves, rise with the tide, and drift with the current alongside. What am I?",
      "answer": "Seaweed"
    },
    {
      "id": "ultimate-collection-278",
      "riddle": "The strangest creature you'll ever find: Two eyes in front and many many more behind.",
      "answer": "Peacock"
    },
    {
      "id": "ultimate-collection-279",
      "riddle": "Two children are born on the same day from the same mother but they are not twins. How is that possible?",
      "answer": "Triplets"
    },
    {
      "id": "ultimate-collection-280",
      "riddle": "Tall when seated, short when standing.",
      "answer": "Dog"
    },
    {
      "id": "ultimate-collection-281",
      "riddle": "When my first is a task to a young girl of spirit, And my second confines her to finish the piece, How hard is her fate! But how great is her merit If by taking my whole she effects her release!",
      "answer": "Hemlock"
    },
    {
      "id": "ultimate-collection-282",
      "riddle": "I bubble and laugh And spit water in your face. I am no lady, And I don't wear lace.",
      "answer": "Fountain"
    },
    {
      "id": "ultimate-collection-283",
      "riddle": "When I point up it's bright, but when I point down it's dark. What am I?",
      "answer": "Light switch"
    },
    {
      "id": "ultimate-collection-284",
      "riddle": "A hundred brothers lie next to each other; Each white and fine - they've only one spine. I am the tongue that lies between two. Remove me to gather their wisdom to you.",
      "answer": "Book"
    },
    {
      "id": "ultimate-collection-285",
      "riddle": "What has to be broken before you can use it?",
      "answer": "Egg"
    },
    {
      "id": "ultimate-collection-286",
      "riddle": "I can be dropped from the tallest of buildings and survive, but drop me from the smallest ship and I won't. What am I?",
      "answer": "Paper"
    },
    {
      "id": "ultimate-collection-287",
      "riddle": "Handy when you need to measure something or run a kingdom.",
      "answer": "Ruler"
    },
    {
      "id": "ultimate-collection-288",
      "riddle": "I have four wings, but cannot fly, I never laugh and never cry; on the same spot I'm always found, toiling away with little sound. What am I?",
      "answer": "Windmill"
    },
    {
      "id": "ultimate-collection-289",
      "riddle": "With my pair I should be, But I am usually alone you see, For a monster always eats me. Do you know what I must be?",
      "answer": "Sock"
    },
    {
      "id": "ultimate-collection-290",
      "riddle": "What flies around all day but never goes anywhere?",
      "answer": "Flag"
    },
    {
      "id": "ultimate-collection-291",
      "riddle": "Patch upon patch, without any stitches, if you tell me this riddle, I'll give you my breeches.",
      "answer": "Cabbage"
    },
    {
      "id": "ultimate-collection-292",
      "riddle": "In spring I look gay, Covered in a green array, The warmer it gets the more clothing I wear, As the cold grows, I throw away my clothes.",
      "answer": "Tree"
    },
    {
      "id": "ultimate-collection-293",
      "riddle": "If your life is cut short, I am not the one to blame. You signed up, and your death was not my aim. Enter our doors; there is so much to see, We just happen to hold the key, To adventure abound And fun to be found Step in our door And see what is in store. What am I?",
      "answer": "Arcade"
    },
    {
      "id": "ultimate-collection-294",
      "riddle": "If you drop a yellow hat in the Red Sea what will it become?",
      "answer": "Wet"
    },
    {
      "id": "ultimate-collection-295",
      "riddle": "I can run but never walk. Wherever I go, thoughts are close behind me. What am I?",
      "answer": "Nose"
    },
    {
      "id": "ultimate-collection-296",
      "riddle": "What seven-letter word becomes longer when the third letter is removed?",
      "answer": "Lounger"
    },
    {
      "id": "ultimate-collection-297",
      "riddle": "Steals an event or even a mood. Reveals the truth or shatters it.",
      "answer": "Camera"
    },
    {
      "id": "ultimate-collection-298",
      "riddle": "I build bridges of silver and crowns of gold. Who am I?",
      "answer": "Dentist"
    },
    {
      "id": "ultimate-collection-299",
      "riddle": "I'm light as a feather, yet the strongest man can't hold me for more than 5 minutes. What am I?",
      "answer": "Breath"
    },
    {
      "id": "ultimate-collection-300",
      "riddle": "My thunder comes before my lightning. My lightning comes before my rain. And my rain dries all the ground it touches. What am I?",
      "answer": "Volcano"
    },
    {
      "id": "ultimate-collection-301",
      "riddle": "I love to wake up at noon And help with the many JOBS I prefer the countryside to the city I help produce the things you eat What Am I?",
      "answer": "Farmer"
    },
    {
      "id": "ultimate-collection-302",
      "riddle": "I am used to bat with, yet I never get a hit. I am near a ball, yet it is never thrown. What am I?",
      "answer": "Eyelash"
    },
    {
      "id": "ultimate-collection-303",
      "riddle": "I have a title and many pages I am a gentiel of gentiel descent I am a killer veteran of war I am a slave to my lord Pledged to his service.",
      "answer": "Knight"
    },
    {
      "id": "ultimate-collection-304",
      "riddle": "You can see nothing else when you look in my face, I will look you in the eye and I will never lie. What am I?",
      "answer": "Mirror"
    },
    {
      "id": "ultimate-collection-305",
      "riddle": "What gets wetter and wetter the more it dries?",
      "answer": "Towel"
    },
    {
      "id": "ultimate-collection-306",
      "riddle": "What has 4 fingers and a thumb, but is not living?",
      "answer": "Glove"
    },
    {
      "id": "ultimate-collection-307",
      "riddle": "What has black spots and a white face, is fat not thin, and helps you to win, but tumbles all over the place?",
      "answer": "Dice"
    },
    {
      "id": "ultimate-collection-308",
      "riddle": "What five-letter word, no matter how you pronounce it, is always pronounced wrong?",
      "answer": "Wrong"
    },
    {
      "id": "ultimate-collection-309",
      "riddle": "Not a burden for its weight and daily carried out, He who takes it wishes it had never come about.",
      "answer": "Coffin"
    },
    {
      "id": "ultimate-collection-310",
      "riddle": "What is red and nailed to a wall?",
      "answer": "Painting"
    },
    {
      "id": "ultimate-collection-311",
      "riddle": "It has no life but it sleeps.",
      "answer": "Laptop"
    },
    {
      "id": "ultimate-collection-312",
      "riddle": "What can be right but never wrong?",
      "answer": "Angle"
    },
    {
      "id": "ultimate-collection-313",
      "riddle": "Two legs I have, and this will confound, only at rest do they touch the ground. What am I?",
      "answer": "Wheelbarrow"
    },
    {
      "id": "ultimate-collection-314",
      "riddle": "What is given but kept by the giver?",
      "answer": "Birth"
    },
    {
      "id": "ultimate-collection-315",
      "riddle": "I have eight to spare and am covered with hair.",
      "answer": "Dog"
    },
    {
      "id": "ultimate-collection-316",
      "riddle": "What is so delicate that saying its name breaks it?",
      "answer": "Silence"
    },
    {
      "id": "ultimate-collection-317",
      "riddle": "I throw the eggs; they crow immediately.",
      "answer": "Rooster"
    },
    {
      "id": "ultimate-collection-318",
      "riddle": "It is hate and has hate in it, but it isn't hate.",
      "answer": "Alphabet"
    },
    {
      "id": "ultimate-collection-319",
      "riddle": "No head has he but he wears a hat. No feet has he but he stands up straight. On him perhaps a fairy sat, weaving a spell one evening late!",
      "answer": "Mushroom"
    },
    {
      "id": "ultimate-collection-320",
      "riddle": "What has 3 feet but cannot walk?",
      "answer": "Yardstick"
    },
    {
      "id": "ultimate-collection-321",
      "riddle": "I am two-faced, but bear one head. Men spill their blood for me. I have no legs but travel widely. I make kings immortal. I am potent when shared; Yet lust for my power keeps me locked away. What am I?",
      "answer": "Coin"
    },
    {
      "id": "ultimate-collection-322",
      "riddle": "I wear a red coat and have a stone in my throat.",
      "answer": "Cherry"
    },
    {
      "id": "ultimate-collection-323",
      "riddle": "A skin have I, more eyes than one. I can be very nice when I am done. What am I?",
      "answer": "Potato"
    },
    {
      "id": "ultimate-collection-324",
      "riddle": "You can spin, wheel and twist, but it can turn without moving. What is it?",
      "answer": "Milk"
    },
    {
      "id": "ultimate-collection-325",
      "riddle": "Long and slinky like a trout, never sings till its guts come out. What is it?",
      "answer": "Gun"
    },
    {
      "id": "ultimate-collection-326",
      "riddle": "Rearrange the letters OWONDER to make one word.",
      "answer": "One word"
    },
    {
      "id": "ultimate-collection-327",
      "riddle": "There's no reason to fear If you see me lurking here Even though I shouldn't exist But few might have missed That I'm not at all real Because nothing can conceal The fact that I'm something That's not at all living What am I?",
      "answer": "Ghost"
    },
    {
      "id": "ultimate-collection-328",
      "riddle": "I am slim and tall, Many find me desirable and appealing, They touch me and I give a false good feeling, Once I shine in splendor, But only once and then no more, For many I am to die for. What am I?",
      "answer": "Cigarette"
    },
    {
      "id": "ultimate-collection-329",
      "riddle": "A truck driver is going opposite traffic on a one-way street. A police officer sees him but doesn't stop him. Why didn't the police officer stop him?",
      "answer": "He was walking"
    },
    {
      "id": "ultimate-collection-330",
      "riddle": "He stands beside the road in a purple cap and tattered green cloak. Those who touch him, curse him.",
      "answer": "Thistle"
    },
    {
      "id": "ultimate-collection-331",
      "riddle": "I fly, yet I have no wings. I cry, yet I have no eyes. Darkness follows me; lower light I never see. What am I?",
      "answer": "Cloud"
    },
    {
      "id": "ultimate-collection-332",
      "riddle": "You will know that I am coming from the jingle of my bell, but exactly who I am is not an easy thing to tell. Children, they adore me for they find me jolly, but I do not see them when the halls are decked with holly. My JOB often leaves me frozen, I am a man that all should know, but I do not do business in times of sleet or ice or snow. I travel much on business, but no reindeer haul me around, I do all my traveling firmly on the ground. I love the time of Christmas, but that's not my vocational season, and I assure that is because of a sound economic reason. Who am I?",
      "answer": "Ice cream man"
    },
    {
      "id": "ultimate-collection-333",
      "riddle": "Arnold Schwarzenegger has a big one, Michael j fox has a small one, Madonna doesn't have one, The pope has one but he never uses it, Bill Clinton Has one and he uses it all the time! What is it?",
      "answer": "Last name"
    },
    {
      "id": "ultimate-collection-334",
      "riddle": "When you do not know what I am, then I am something. But when you know what I am, then I am nothing. What am I?",
      "answer": "Riddle"
    },
    {
      "id": "ultimate-collection-335",
      "riddle": "Alight or in dark, my face is a leer. In a field with my brothers, you'll find me without bother, For that autumn day is mine.",
      "answer": "Pumpkin"
    },
    {
      "id": "ultimate-collection-336",
      "riddle": "I do not listen to reason, but I hear every siren's song and will try to steer us towards the rocks if you let me take the wheel. Who am I?",
      "answer": "Emotion"
    },
    {
      "id": "ultimate-collection-337",
      "riddle": "Born at the same time as the world, destined to live as long as the world, and yet never five weeks old. What is it?",
      "answer": "Moon"
    },
    {
      "id": "ultimate-collection-338",
      "riddle": "Even if you throw it away, it still comes back",
      "answer": "Boomerang"
    },
    {
      "id": "ultimate-collection-339",
      "riddle": "What do you have when you're sitting down that you don't have when you're standing up?",
      "answer": "Lap"
    },
    {
      "id": "ultimate-collection-340",
      "riddle": "Goes over all the hills and hollows, Bites hard, but never swallows.",
      "answer": "Frost"
    },
    {
      "id": "ultimate-collection-341",
      "riddle": "What disappears coming from there to here and reappears going from here to there?",
      "answer": "The letter T"
    },
    {
      "id": "ultimate-collection-342",
      "riddle": "The 8 of us move back, and forth to protect our king from the foes attack. What are we?",
      "answer": "Pawns"
    },
    {
      "id": "ultimate-collection-343",
      "riddle": "I'm not mans best friend, I'm their enemy, I can mark your end, yet you do not see me, I am very small, But very tough, If you have me, then you have it rough.",
      "answer": "Disease"
    },
    {
      "id": "ultimate-collection-344",
      "riddle": "Weight in my stomach, trees on my back, nails in my ribs, its feet I lack. What am I?",
      "answer": "Ship"
    },
    {
      "id": "ultimate-collection-345",
      "riddle": "A bus driver was heading down a street in Colorado. He went right past a stop sign without stopping, he turned left where there was a no left turn sign, and he went the wrong way on a one-way street. Then he went on the left side of the road past a cop car. Still - he didn't break any traffic laws. Why not?",
      "answer": "He was walking"
    },
    {
      "id": "ultimate-collection-346",
      "riddle": "I come when the weather is at its prime, Though, it might be wise to leave nothing on the street. But, in the wintertime My name is obsolete What am I?",
      "answer": "Street sweeper"
    },
    {
      "id": "ultimate-collection-347",
      "riddle": "I'm tall when I'm young and I'm short when I'm old. What am I?",
      "answer": "Candle"
    },
    {
      "id": "ultimate-collection-348",
      "riddle": "The stack just might be sent all over. Full of what's new, yet it's nearly obsolete.",
      "answer": "Newspaper"
    },
    {
      "id": "ultimate-collection-349",
      "riddle": "What's always coming, but never arrives?",
      "answer": "Tomorrow"
    },
    {
      "id": "ultimate-collection-350",
      "riddle": "A man was playing a game 4 miles away from his house. After 5 minutes, he ran home in 13 seconds. He doesn't have super powers, and the game doesn't require moving closer to his house. How is this possible?",
      "answer": "Baseball"
    },
    {
      "id": "ultimate-collection-351",
      "riddle": "What word looks the same upside down and backwards?",
      "answer": "SWIMS"
    },
    {
      "id": "ultimate-collection-352",
      "riddle": "We chop its feet; we drink its blood.",
      "answer": "Tree"
    },
    {
      "id": "ultimate-collection-353",
      "riddle": "What goes up and down without moving?",
      "answer": "Stairs"
    },
    {
      "id": "ultimate-collection-354",
      "riddle": "What can you catch but not throw?",
      "answer": "Cold"
    },
    {
      "id": "ultimate-collection-355",
      "riddle": "I live in a busy place in the city, I'll let you stay with me for a while, If you don't feed me, I can get you into trouble. What am I?",
      "answer": "Parking meter"
    },
    {
      "id": "ultimate-collection-356",
      "riddle": "A very pretty thing I am, fluttering in the pale-blue sky. Delicate, fragile on the wing, indeed I am a pretty thing. What am I?",
      "answer": "Butterfly"
    },
    {
      "id": "ultimate-collection-357",
      "riddle": "I saw the dead bring forth the living. I saw the living bring forth the dead. Who or what did I see?",
      "answer": "Fire and wood"
    },
    {
      "id": "ultimate-collection-358",
      "riddle": "Just head and foot yet never tires of dancing,",
      "answer": "Spinning top"
    },
    {
      "id": "ultimate-collection-359",
      "riddle": "Deep, deep, do they go. Spreading out as they go. Never needing any air. They are sometimes as fine as hair.",
      "answer": "Roots"
    },
    {
      "id": "ultimate-collection-360",
      "riddle": "What demands an answer, but asks no question?",
      "answer": "Phone"
    },
    {
      "id": "ultimate-collection-361",
      "riddle": "No thicker than your finger when it folds. As thick as what it's holding when it holds.",
      "answer": "Bag"
    },
    {
      "id": "ultimate-collection-362",
      "riddle": "What do you find in the kitchen that is not alive?",
      "answer": "Deadpans"
    },
    {
      "id": "ultimate-collection-363",
      "riddle": "With thieves I consort, With the vilest, in short, I'm quite at ease in depravity; Yet all divines use me, And savants can't lose me, For I am the center of gravity.",
      "answer": "The letter V"
    },
    {
      "id": "ultimate-collection-364",
      "riddle": "Full of dark, filled with everything Both on my skin they color With my pack, I am always Afraid of the cat. What am I?",
      "answer": "Zebra"
    },
    {
      "id": "ultimate-collection-365",
      "riddle": "I have four legs, a back, but no head. What am I?",
      "answer": "A chair"
    },
    {
      "id": "ultimate-collection-366",
      "riddle": "I am something all men have but all men deny. Man created me but no man can hold me. What am i?",
      "answer": "Fear"
    },
    {
      "id": "ultimate-collection-367",
      "riddle": "Half of the population uses me, and you lose me all the time. I'm small and yellow, black, brown or silver. You use me to hold things up. What am I?",
      "answer": "Bobbypins"
    },
    {
      "id": "ultimate-collection-368",
      "riddle": "I have many feathers to help me fly. I have a body and head, but I'm not alive. It is your strength that determines how far I go. You can hold me in your, but I'm never thrown. What am I?",
      "answer": "An arrow"
    },
    {
      "id": "ultimate-collection-369",
      "riddle": "I go around in circles, But always straight ahead Never complain, No matter where I am led.",
      "answer": "Wheel"
    },
    {
      "id": "ultimate-collection-370",
      "riddle": "What can an elephant and a shrimp both be?",
      "answer": "Jumbo"
    },
    {
      "id": "ultimate-collection-371",
      "riddle": "I am flora, not fauna, I am foliage, not trees, I am shrubbery, not grass, What am I?",
      "answer": "A bush"
    },
    {
      "id": "ultimate-collection-372",
      "riddle": "Which tree is the most difficult to get along with?",
      "answer": "A crab tree"
    },
    {
      "id": "ultimate-collection-373",
      "riddle": "It produces a flower but it is not its fruit; it produces branches which are its fruit.",
      "answer": "Sweet Corn"
    },
    {
      "id": "ultimate-collection-374",
      "riddle": "In the prairie it was stabbed, in the house it was pulled.",
      "answer": "Crabgrass"
    },
    {
      "id": "ultimate-collection-375",
      "riddle": "I cannot hear or even see, But sense light and sounds there may be, Sometimes I end up on a hook, I can be combined with a book. What am I?",
      "answer": "A worm"
    },
    {
      "id": "ultimate-collection-376",
      "riddle": "I have a tongue but cannot taste. I have a soul but cannot feel. What am I?",
      "answer": "A shoe"
    },
    {
      "id": "ultimate-collection-377",
      "riddle": "What is everyone in the world doing at the same time?",
      "answer": "Growing old"
    },
    {
      "id": "ultimate-collection-378",
      "riddle": "What is something you will never see again?",
      "answer": "Yesterday"
    },
    {
      "id": "ultimate-collection-379",
      "riddle": "Why can't the Tyrannosaurus rex clap?",
      "answer": "They are extinct"
    },
    {
      "id": "ultimate-collection-380",
      "riddle": "A red house is made out of red bricks. A blue house is made out of blue bricks. What is a green house made out of?",
      "answer": "Gases"
    },
    {
      "id": "ultimate-collection-381",
      "riddle": "I'm a king that speaks for my country At birth I protected by no one As I grow my fathers gives me 2 soldiers to protect me As I get matured many more are given to me And at my full age my father gives me 32 white soldiers to guard me and protect me What Am I?",
      "answer": "Tongue"
    },
    {
      "id": "ultimate-collection-382",
      "riddle": "From house to house I go, sometimes narrow, sometimes wide. And whether there's rain or snow I always stay outside. What am I?",
      "answer": "Path"
    },
    {
      "id": "ultimate-collection-383",
      "riddle": "For our ambrosia we were blessed, By Jupiter, with a sting of death. Though our might, to some is jest, We have quelled the dragon's breath. Who are we?",
      "answer": "Bees"
    },
    {
      "id": "ultimate-collection-384",
      "riddle": "I end and begin the day, Without me, you'll pay. With the aid of sheep, All my benefits you shall reap. If I make you miss class, You shall not pass! What am I?",
      "answer": "Sleep"
    },
    {
      "id": "ultimate-collection-385",
      "riddle": "What heavy seven letter word can you take two away from and be left with eight?",
      "answer": "Weights"
    },
    {
      "id": "ultimate-collection-386",
      "riddle": "I stare at you, you stare at me. I have three eyes, yet can't see. Every time I blink, I give you commands. You do as you are told, with your feet and hands. What am I?",
      "answer": "Traffic light"
    },
    {
      "id": "ultimate-collection-387",
      "riddle": "Three little letters, a paradox to some. The worse that it is, the better it becomes.",
      "answer": "Pun"
    },
    {
      "id": "ultimate-collection-388",
      "riddle": "Nothing specific, but more than a few. This many clustered, together will do.",
      "answer": "Several"
    },
    {
      "id": "ultimate-collection-389",
      "riddle": "I am the first you ever saw, what greets you every morning and what goes out in the end.",
      "answer": "Light"
    },
    {
      "id": "ultimate-collection-390",
      "riddle": "Made of ten but two we make, When assembled others quake, Five apart and we are weak, Five together havoc wreak. What are we?",
      "answer": "Fists"
    },
    {
      "id": "ultimate-collection-391",
      "riddle": "What can be measured but has no length, width or height?",
      "answer": "Temperature"
    },
    {
      "id": "ultimate-collection-392",
      "riddle": "I am window, I am lamp, I am clouded, I am shining and I am colored, set in white, I fill with water and overflow. I say much but I have no words. What am I?",
      "answer": "Eye"
    },
    {
      "id": "ultimate-collection-393",
      "riddle": "I am seen in the water If seen in the sky, I am in the rainbow, A jay's feather, And lapis lazuli.",
      "answer": "Blue"
    },
    {
      "id": "ultimate-collection-394",
      "riddle": "Part carbon, part water, I am poison to the fishes. Many have falsely claimed my name, for I am the pause that refreshes.",
      "answer": "Coke"
    },
    {
      "id": "ultimate-collection-395",
      "riddle": "Lighter than what I'm made of, more of me is hidden than is seen. What am I?",
      "answer": "Iceberg"
    },
    {
      "id": "ultimate-collection-396",
      "riddle": "Bulbs on branches, High in the trees, Can I please have one of these? A pony a puppy, and a kitty to! Oh my thank you! They're shiny and new! We gather together, to give and receive, On this it's special to me.",
      "answer": "Christmas"
    },
    {
      "id": "ultimate-collection-397",
      "riddle": "It's in your hand though you cannot feel it. Only you and time can reveal it.",
      "answer": "Fate"
    },
    {
      "id": "ultimate-collection-398",
      "riddle": "There is a creature of God whose body is hard; it does not wish to eat unless you strike its head.",
      "answer": "Nail"
    },
    {
      "id": "ultimate-collection-399",
      "riddle": "Screaming, soaring Seeking sky. Flowers of fire Flying high, Eastern art From ancient time Name me now And solve this rhyme.",
      "answer": "Fireworks"
    },
    {
      "id": "ultimate-collection-400",
      "riddle": "I'm a word, six letters long; I sometimes enter with a gong. All in order from A to Z, I start with the letter B. What is the word?",
      "answer": "Begins"
    },
    {
      "id": "ultimate-collection-401",
      "riddle": "What goes up and never comes down?",
      "answer": "Age"
    },
    {
      "id": "ultimate-collection-402",
      "riddle": "What time is spelled the same forwards and backwards?",
      "answer": "Noon"
    },
    {
      "id": "ultimate-collection-403",
      "riddle": "This on this. That on that. Growing tall, But never fat. What am I?",
      "answer": "Snowman"
    },
    {
      "id": "ultimate-collection-404",
      "riddle": "What kinds of men are always above board?",
      "answer": "Chessmen"
    },
    {
      "id": "ultimate-collection-405",
      "riddle": "What do you get if you put a radio in the fridge?",
      "answer": "Cool music"
    },
    {
      "id": "ultimate-collection-406",
      "riddle": "Useful tool for who in darkness dwell. Within you, corrupting like a deadly spell.",
      "answer": "Ignorance"
    },
    {
      "id": "ultimate-collection-407",
      "riddle": "It may only be given, Not taken or bought, What the sinner desires, But the saint does not.",
      "answer": "Forgiveness"
    },
    {
      "id": "ultimate-collection-408",
      "riddle": "What gets broken without being hold?",
      "answer": "Promise"
    },
    {
      "id": "ultimate-collection-409",
      "riddle": "What has a head yet it never weeps, has a bed but never sleeps, can run but can not walks, and has a bank but not a cent to its name?",
      "answer": "River"
    },
    {
      "id": "ultimate-collection-410",
      "riddle": "Shoot at me a thousand times and I may still survive; one scratch from you and me will find your prospects take a dive. What am I?",
      "answer": "Eight ball"
    },
    {
      "id": "ultimate-collection-411",
      "riddle": "Is there a number which, when written as a word has same number of letters as its numerical value?",
      "answer": "Four"
    },
    {
      "id": "ultimate-collection-412",
      "riddle": "A father's child. A mother's child. No one's son. Who am I?",
      "answer": "Daughter"
    },
    {
      "id": "ultimate-collection-413",
      "riddle": "Shifting, Shifting, Drifting deep. Below me great and mighty cities sleep. Swirling, Scurlling, All around. I'm only where no water will be found.",
      "answer": "Desert"
    },
    {
      "id": "ultimate-collection-414",
      "riddle": "What stinks when living and smells good when dead?",
      "answer": "Bacon"
    },
    {
      "id": "ultimate-collection-415",
      "riddle": "What is that which goes with a carriage, comes with a carriage, is of no use to a carriage, and yet the carriage cannot go without it?",
      "answer": "Noise"
    },
    {
      "id": "ultimate-collection-416",
      "riddle": "What is red and smells like blue paint?",
      "answer": "Red paint"
    },
    {
      "id": "ultimate-collection-417",
      "riddle": "I am greater than God, more evil than the devil, the poor have me, the rich don't, and if you eat me, you'll die. What am I?",
      "answer": "Nothing"
    },
    {
      "id": "ultimate-collection-418",
      "riddle": "What can burn the eyes, sting the mouth, yet be consumed and thought delicious?",
      "answer": "Pepper"
    },
    {
      "id": "ultimate-collection-419",
      "riddle": "The more you take from me, the bigger I get. What am I?",
      "answer": "Hole"
    },
    {
      "id": "ultimate-collection-420",
      "riddle": "Always well dressed, but I never fly. Black and white, sometimes in a tie. I swim and slide, and dance and glide, With one person by my side. What am I?",
      "answer": "Penguin"
    },
    {
      "id": "ultimate-collection-421",
      "riddle": "It's got twists and turns, but has no curves. Twist it to fix it, turn it to ruin it. What is it?",
      "answer": "Rubiks cube"
    },
    {
      "id": "ultimate-collection-422",
      "riddle": "The part of the bird, that is not in the sky, Which can swim in the ocean and always stay dry. What is it?",
      "answer": "Shadow"
    },
    {
      "id": "ultimate-collection-423",
      "riddle": "I am a strange creature, Hovering in the air, Moving from here to there, with a brilliant flare. Some say I sing, but others say I have no voice. So I just hum - as a matter of choice. What am I?",
      "answer": "Hummingbird"
    },
    {
      "id": "ultimate-collection-424",
      "riddle": "If a man carried my burden, he would break his back. I am not rich, but I leave silver in my track. What am I?",
      "answer": "Snail"
    },
    {
      "id": "ultimate-collection-425",
      "riddle": "What building has the most stories?",
      "answer": "Library"
    },
    {
      "id": "ultimate-collection-426",
      "riddle": "What starts with the letter t, is filled with t and ends in t?",
      "answer": "Teapot"
    },
    {
      "id": "ultimate-collection-427",
      "riddle": "A little pool with two layers of wall around it. One white and soft and the other dark and hard, amidst a light brown grassy lawn with an outline of a green grass. What am I?",
      "answer": "Coconut"
    },
    {
      "id": "ultimate-collection-428",
      "riddle": "Both king and horse have this, of course, But you'll want neither of them, perforce.",
      "answer": "Charley horse"
    },
    {
      "id": "ultimate-collection-429",
      "riddle": "What 11 letter English word is always pronounced incorrectly?",
      "answer": "Incorrectly"
    },
    {
      "id": "ultimate-collection-430",
      "riddle": "A cloud was my mother, the wind is my father, my son is the cool stream, and my daughter is the fruit of the land. A rainbow is my bed, the earth my final resting place, and I'm the torment of man.",
      "answer": "Rain"
    },
    {
      "id": "ultimate-collection-431",
      "riddle": "One simple click, one simple flash. Preserving a memory, for years I will last. What am I?",
      "answer": "Camera"
    },
    {
      "id": "ultimate-collection-432",
      "riddle": "It is sharp but not pepper; white but not paper; green but not shaddock; guess what that is.",
      "answer": "Leek"
    },
    {
      "id": "ultimate-collection-433",
      "riddle": "I can be told and can make you crazy, Most people don't like me and think I'm harmful. What am I?",
      "answer": "Lie"
    },
    {
      "id": "ultimate-collection-434",
      "riddle": "I can always go up, never down, I can always turn left, never right, I am always hot when I'm cold",
      "answer": "Thermometer"
    },
    {
      "id": "ultimate-collection-435",
      "riddle": "What has roots you cannot see, up up it goes, yet never grows.",
      "answer": "Mountain"
    },
    {
      "id": "ultimate-collection-436",
      "riddle": "My coat keeps me safe From damage that's near. I cause you happiness, sadness, Anticipation and fear. On the outside, I am put under judgment of price. But my insides have far more value That not even MONEY can suffice.",
      "answer": "Book"
    },
    {
      "id": "ultimate-collection-437",
      "riddle": "What can you fold but not crease?",
      "answer": "Poker"
    },
    {
      "id": "ultimate-collection-438",
      "riddle": "A man is wearing all black. A black car is approaching towards the man. How did the driver managed to stop in time?",
      "answer": "Daytime"
    },
    {
      "id": "ultimate-collection-439",
      "riddle": "I'm a very valuable thing to have. Use me right now, you should. Yet if you cut off my hindquarters, I'd be but a piece of wood. What am I?",
      "answer": "Good"
    },
    {
      "id": "ultimate-collection-440",
      "riddle": "Above all things have I been placed Thus have I, a man disgraced. I describe sunlight or lock But after all, I'm just a rock.",
      "answer": "Cornerstone"
    },
    {
      "id": "ultimate-collection-441",
      "riddle": "On my way to St. Ives, I met a man with seven wives. Each wife had seven sacks, Each sack had seven cats, Each cat had seven kits. Kits, cats, sacks, wives, How many were going to St. Ives?",
      "answer": "One"
    },
    {
      "id": "ultimate-collection-442",
      "riddle": "What has everything inside it? Everything you can imagine even god, wind, world, sky, heaven, earth and everything that comes to your mind?",
      "answer": "Dictionary"
    },
    {
      "id": "ultimate-collection-443",
      "riddle": "What goes up, but at the same time goes down? Up toward the sky, and down toward the ground. Its present tense and past tense too, come for a ride, just you and me!!!",
      "answer": "Seesaw"
    },
    {
      "id": "ultimate-collection-444",
      "riddle": "What is it that makes tears without sorrow and takes its journey to heaven?",
      "answer": "Smoke"
    },
    {
      "id": "ultimate-collection-445",
      "riddle": "I saw a strange creature, Long, hard, and straight, Thrusting in a round, dark, opening, Preparing to discharge its load of lives, Puffing and squealing noises accompanied it, Then a final screech as it slowed and stopped.",
      "answer": "Train"
    },
    {
      "id": "ultimate-collection-446",
      "riddle": "I go around all the places; cities, towns and villages, but never come inside. What am I?",
      "answer": "Street"
    },
    {
      "id": "ultimate-collection-447",
      "riddle": "An open ended barrel, it is shaped like a hive. It is filled with the flesh, and the flesh is alive!",
      "answer": "Thimble"
    },
    {
      "id": "ultimate-collection-448",
      "riddle": "I warn you about meetings, and I assist you in my life, I can help you do most of my work, unless I have a bug. What am I?",
      "answer": "Calendar"
    },
    {
      "id": "ultimate-collection-449",
      "riddle": "Poke your fingers in my eyes and I will open wide my jaws. Linen cloth, quills, or paper, my greedy lust devours them all. What am I?",
      "answer": "Scissors"
    },
    {
      "id": "ultimate-collection-450",
      "riddle": "Pedro hides but his head is still exposed",
      "answer": "Turtle"
    },
    {
      "id": "ultimate-collection-451",
      "riddle": "I have one, you have one. If you remove the first letter, a bit remains. If you remove the second, bit still remains. After much trying, you might be able to remove the third one also, but it remains. What am I?",
      "answer": "Habit"
    },
    {
      "id": "ultimate-collection-452",
      "riddle": "Faster than a twitch! Fly with me to the Pitch! With a seeker, a keeper, Or a chaser, a beater, Wizard or witch; I play a mean game of Quidditch. What am I?",
      "answer": "Snitch"
    },
    {
      "id": "ultimate-collection-453",
      "riddle": "Round like a dishpan and smaller than a bathtub. But the ocean can't fill it. What is it?",
      "answer": "Sieve"
    },
    {
      "id": "ultimate-collection-454",
      "riddle": "I'm named after nothing, though I'm awfully clamorous. And when I'm not working, your house is less glamorous. What am I?",
      "answer": "Vacuum"
    },
    {
      "id": "ultimate-collection-455",
      "riddle": "When they are caught, they are thrown away. When they escape, you itch all day.",
      "answer": "Fleas"
    },
    {
      "id": "ultimate-collection-456",
      "riddle": "What gets bigger as you take out of it?",
      "answer": "Hole"
    },
    {
      "id": "ultimate-collection-457",
      "riddle": "I am a notebook, but have no pages. I have a screen, but not to keep bugs, just pests.",
      "answer": "Laptop"
    },
    {
      "id": "ultimate-collection-458",
      "riddle": "What must be in the oven yet cannot be baked? Grows in the heat yet shuns the light of day? What sinks in water but rises with air? Looks like skin, but is fine as hair?",
      "answer": "Dough"
    },
    {
      "id": "ultimate-collection-459",
      "riddle": "I am everywhere. Nothing can compare. Run and hide and I will still be there Because everything is mine to share. No need to seek me out, Though, you may just run out. What am I?",
      "answer": "Time"
    },
    {
      "id": "ultimate-collection-460",
      "riddle": "A fruit on a tree. A tree on a fruit.",
      "answer": "Pineapple"
    },
    {
      "id": "ultimate-collection-461",
      "riddle": "Hands she has but does not hold, teeth she has but does not bite, feet she has but they are cold, eyes she has but without sight. Who is she?",
      "answer": "Doll"
    },
    {
      "id": "ultimate-collection-462",
      "riddle": "We are emeralds and diamonds, Lost by the moon; Found by the sun, And picked up soon.",
      "answer": "Dew"
    },
    {
      "id": "ultimate-collection-463",
      "riddle": "I cannot be felt, seen or touched; Yet I can be found in everybody; My existence is always in debate; Yet there is a style of music named after me.",
      "answer": "Soul"
    },
    {
      "id": "ultimate-collection-464",
      "riddle": "What is bought by the yard by is worn by the foot?",
      "answer": "Carpet"
    },
    {
      "id": "ultimate-collection-465",
      "riddle": "He's small but he can climb a tower.",
      "answer": "Ant"
    },
    {
      "id": "ultimate-collection-466",
      "riddle": "What can't you see, hear or feel, until it's too late. What shadows love, and shop keepers hate?",
      "answer": "Thief"
    },
    {
      "id": "ultimate-collection-467",
      "riddle": "Ten Men's Strength, Ten Men's Length, Ten Men can't break it, yet a young boy walks off with it What am I?",
      "answer": "Rope"
    },
    {
      "id": "ultimate-collection-468",
      "riddle": "I am the center of Gravity.",
      "answer": "Letter V"
    },
    {
      "id": "ultimate-collection-469",
      "riddle": "What two things can you never eat for breakfast?",
      "answer": "Lunch and dinner"
    },
    {
      "id": "ultimate-collection-470",
      "riddle": "Forwards I am heavy, but backwards I am not. What am I?",
      "answer": "Ton"
    },
    {
      "id": "ultimate-collection-471",
      "riddle": "I am nothing but holes tied to holes, yet am strong as iron.",
      "answer": "Chain"
    },
    {
      "id": "ultimate-collection-472",
      "riddle": "I work hard most every day, Not much time to dance and play, If I could reach what I desire, all like me would now retire. What am I?",
      "answer": "Miner"
    },
    {
      "id": "ultimate-collection-473",
      "riddle": "Blow for blow, They matched each other. Neither would fall to the other. In the eyes of the crowd, They were this.",
      "answer": "Even"
    },
    {
      "id": "ultimate-collection-474",
      "riddle": "Twice I appear to take them away. There is nowhere I can't reach. I come at your beck and call No matter where you are. But, while you see me appear You never see me before I draw near. What am I?",
      "answer": "Hearse"
    },
    {
      "id": "ultimate-collection-475",
      "riddle": "When set loose, I fly away, Never so cursed, as when I go astray",
      "answer": "Arrow"
    },
    {
      "id": "ultimate-collection-476",
      "riddle": "What kind of street does a ghost like best?",
      "answer": "Dead end"
    },
    {
      "id": "ultimate-collection-477",
      "riddle": "I saw a creature: his stomach stuck out behind him, Enormously swollen. A stalwart servant Waited upon him. What filled up his stomach Had travelled from far, and flew through his eye He does not always die in giving life To others, but new strength revives In the pit of his stomach; he breathes again.",
      "answer": "Bellows"
    },
    {
      "id": "ultimate-collection-478",
      "riddle": "A deep well full of knives",
      "answer": "Mouth"
    },
    {
      "id": "ultimate-collection-479",
      "riddle": "You can have it, and be at it, But it never lasts forever.",
      "answer": "Peace"
    },
    {
      "id": "ultimate-collection-480",
      "riddle": "I have lasted many years and still feel young. I have lasted depressions, recessions and even millenniums. I'm richer than the richest of men. You can visit me, but not my owners. I've been shown on T.V. and I can take and give you what is yours, but only if you ask me to. So tell me who or what I am?",
      "answer": "Bank"
    },
    {
      "id": "ultimate-collection-481",
      "riddle": "Which popular cheese is made backwards?",
      "answer": "Edam"
    },
    {
      "id": "ultimate-collection-482",
      "riddle": "I am the ruler of shovels, I have a double, I am as thin as a knife, I have a wife. What am I?",
      "answer": "King of spades"
    },
    {
      "id": "ultimate-collection-483",
      "riddle": "From that which comes within itself, It builds its table on my shelf.",
      "answer": "Spider"
    },
    {
      "id": "ultimate-collection-484",
      "riddle": "How can you physically stand behind your friend as he physically stands behind you?",
      "answer": "Back to back"
    },
    {
      "id": "ultimate-collection-485",
      "riddle": "Poorly behaved children often find themselves sitting in these",
      "answer": "Corners"
    },
    {
      "id": "ultimate-collection-486",
      "riddle": "I cover what is real and hide what is true, But sometimes I bring out the courage in you. What am I?",
      "answer": "Makeup"
    },
    {
      "id": "ultimate-collection-487",
      "riddle": "I am a tale in children's minds. I keep their secrets and share them inside. I blur their thoughts into fantasies kept Like a canvas of art or a submarine depth. Though an illusion, it occurs every night; I give them a fantasy, I give them a fright. Nor good or bad, but always nigh' It's interesting to tell. What am I?",
      "answer": "Dream"
    },
    {
      "id": "ultimate-collection-488",
      "riddle": "Which bow can't be tied?",
      "answer": "Rainbow"
    },
    {
      "id": "ultimate-collection-489",
      "riddle": "A house with two occupants, sometimes one, rarely three. Break the walls, eat the boarders, then throw away me. What am I?",
      "answer": "Peanut"
    },
    {
      "id": "ultimate-collection-490",
      "riddle": "What comes once in a century, twice in a lifetime and never in a thousand years?",
      "answer": "Letter E"
    },
    {
      "id": "ultimate-collection-491",
      "riddle": "I have three hundred cattle, with a single nose cord.",
      "answer": "Rosary"
    },
    {
      "id": "ultimate-collection-492",
      "riddle": "I am the beginning of sorrow, and the end of sickness. You cannot express happiness without me, yet I am in the midst of crosses. I am always in risk, yet never in danger. You may find me in the sun, but I am never out of darkness.",
      "answer": "Letter S"
    },
    {
      "id": "ultimate-collection-493",
      "riddle": "A natural state, I'm sought by all. Go with me and you shall fall. You do me when you spend, and you use me when you eat to no end. What am I?",
      "answer": "Balance"
    },
    {
      "id": "ultimate-collection-494",
      "riddle": "What starts with an e but only has a single letter in it?",
      "answer": "Envelope"
    },
    {
      "id": "ultimate-collection-495",
      "riddle": "I am rather large and usually majestic. I am every hue of the rainbow I can eat you, I may heat you, You only wish you could see me. What am I?",
      "answer": "Dragon"
    },
    {
      "id": "ultimate-collection-496",
      "riddle": "Slowly stretching my arms, I rise up, and move towards warmth. Bursting in colors, my sisters and I. What are we?",
      "answer": "Flowers"
    },
    {
      "id": "ultimate-collection-497",
      "riddle": "Although I'm far from the point, I'm not a mistake. I fix yours. What am I?",
      "answer": "Eraser"
    },
    {
      "id": "ultimate-collection-498",
      "riddle": "There was a green house. Inside the green house there was a white house. Inside the white house there was a red house. Inside the red house there were lots of babies. What is it?",
      "answer": "Watermelon"
    },
    {
      "id": "ultimate-collection-499",
      "riddle": "What fastens two people yet touches only one?",
      "answer": "Wedding ring"
    },
    {
      "id": "ultimate-collection-500",
      "riddle": "What ship has no captain but two mates?",
      "answer": "Courtship"
    },
    {
      "id": "ultimate-collection-501",
      "riddle": "In my life I die twice, once wrapped in silk, once covered in dust.",
      "answer": "Butterfly"
    },
    {
      "id": "ultimate-collection-502",
      "riddle": "How do share 17 apples with 18 people?",
      "answer": "Applesauce"
    },
    {
      "id": "ultimate-collection-503",
      "riddle": "My first is in blood and also in battle, My second is in acorn, oak, and apple, My third and fourth are both the same, In the center of sorrow and twice in refrain, My fifth starts eternity ending here, My last is the first of last, Oh dear!",
      "answer": "Barrel"
    },
    {
      "id": "ultimate-collection-504",
      "riddle": "I am and yet cannot. I am an Idea, yet can rot I am two but none. I am on land, but on sea. What am I?",
      "answer": "Island"
    },
    {
      "id": "ultimate-collection-505",
      "riddle": "What is gold when old and silver when new, hard to find but easy to lose, cost a lot but it's free?",
      "answer": "Friend"
    },
    {
      "id": "ultimate-collection-506",
      "riddle": "What can't you see that is always before you?",
      "answer": "Future"
    },
    {
      "id": "ultimate-collection-507",
      "riddle": "One where none should be, Or maybe where two should be, Seeking out purity, In the kings trees. What am I?",
      "answer": "Partridge"
    },
    {
      "id": "ultimate-collection-508",
      "riddle": "Wounded I am, and weary with fighting; Gashed by iron, gored by the point of it, Sick of battle-work, battered and scarred. Many a fearful fight have I seen, when Hope there was none, or helping the thick of it.",
      "answer": "Shield"
    },
    {
      "id": "ultimate-collection-509",
      "riddle": "I'm that which is seen only in darkness, Swiftest of all, and near as old as time; Day's distant brother; fire and faintness, I light without shadow -- can you solve this rhyme?",
      "answer": "Star"
    },
    {
      "id": "ultimate-collection-510",
      "riddle": "All day long it's in and out. I discharge loads from my shaft. Both men and women go down on me. What am I?",
      "answer": "Elevator"
    },
    {
      "id": "ultimate-collection-511",
      "riddle": "What do you call a wild card?",
      "answer": "Joker"
    },
    {
      "id": "ultimate-collection-512",
      "riddle": "Two arms, one leg and a head, but no eyes.",
      "answer": "Shirt"
    },
    {
      "id": "ultimate-collection-513",
      "riddle": "What kind of tree is carried in your hand?",
      "answer": "Palm"
    },
    {
      "id": "ultimate-collection-514",
      "riddle": "Where is 11+2=1?",
      "answer": "Clock"
    },
    {
      "id": "ultimate-collection-515",
      "riddle": "Has a blade of jagged cut. Keeps the quickest hand out shut. Goes in darkness. Wears a ring. One is quiet. Many sing.",
      "answer": "Saw"
    },
    {
      "id": "ultimate-collection-516",
      "riddle": "Four feet, Jagged teeth Fleet of movement, water and land I have no mood; to me you're food As I drag you under.",
      "answer": "Crocodile"
    },
    {
      "id": "ultimate-collection-517",
      "riddle": "What happens when you throw a blue rock into the yellow sea?",
      "answer": "Sinks"
    },
    {
      "id": "ultimate-collection-518",
      "riddle": "What runs around the yard without moving?",
      "answer": "Fence"
    },
    {
      "id": "ultimate-collection-519",
      "riddle": "Tires a horse, worries a man; Tell me this riddle if you can.",
      "answer": "Debt"
    },
    {
      "id": "ultimate-collection-520",
      "riddle": "Two bodies have I, though both joined in one. The more still I stand, the quicker I run. What am I?",
      "answer": "Hourglass"
    },
    {
      "id": "ultimate-collection-521",
      "riddle": "What kind of table has no legs?",
      "answer": "Periodic table"
    },
    {
      "id": "ultimate-collection-522",
      "riddle": "Some try to hide, some try to cheat, but time will show, we always will meet. Try as you might, to guess my name, I promise you'll know when you I do claim. Who am I?",
      "answer": "Death"
    },
    {
      "id": "ultimate-collection-523",
      "riddle": "A man is writing a letter. The power goes off and he dies. Why?",
      "answer": "Lighthouse keeper"
    },
    {
      "id": "ultimate-collection-524",
      "riddle": "I show things that can be funny, sad, shocking and other emotions. Some people are obsessed some only go a few times. I hold everything that someone wants to be shown.",
      "answer": "Movie theater"
    },
    {
      "id": "ultimate-collection-525",
      "riddle": "My first is in window but not in pane, my second's in road but not in lane, my third is in oval but not in round, my fourth is in hearing but not in sound, my whole is known as a sign of peace, and from Noah's ark won quick release.",
      "answer": "Dove"
    },
    {
      "id": "ultimate-collection-526",
      "riddle": "Who gets paid when they drive away their customers?",
      "answer": "Taxi driver"
    },
    {
      "id": "ultimate-collection-527",
      "riddle": "What is yellow, has wheels, and brightens up mother's day?",
      "answer": "School bus"
    },
    {
      "id": "ultimate-collection-528",
      "riddle": "When I plunged it in it was dry; when I drew it out it was dripping.",
      "answer": "Teabag"
    },
    {
      "id": "ultimate-collection-529",
      "riddle": "One tooth to bite, he's the forests foe. One tooth to fight, as all Norse know. What is it?",
      "answer": "Axe"
    },
    {
      "id": "ultimate-collection-530",
      "riddle": "Use me wisely, For I am hard to find. To your aquatic needs, I will be kind. It may not be worth my slime and grime, For I run out in an hour's time. What am I?",
      "answer": "Hourglass"
    },
    {
      "id": "ultimate-collection-531",
      "riddle": "Apples for leather, leather for silk, Silk for tobacco, all to get milk.",
      "answer": "Trade"
    },
    {
      "id": "ultimate-collection-532",
      "riddle": "He laughs plain and talks plain but haven't any life.",
      "answer": "Portrait"
    },
    {
      "id": "ultimate-collection-533",
      "riddle": "Fatherless and Motherless, born without sin Roared when it came into the world, And never spoke again.",
      "answer": "Thunder"
    },
    {
      "id": "ultimate-collection-534",
      "riddle": "Halo of water, tongue of wood Skin of stone, long I've stood. My fingers short reach to the sky Inside my heart men live and die.",
      "answer": "Castle"
    },
    {
      "id": "ultimate-collection-535",
      "riddle": "What has holes on each side, but can still hold water?",
      "answer": "Sponge"
    },
    {
      "id": "ultimate-collection-536",
      "riddle": "The higher I climb, the hotter I engage, I cannot escape my crystal cage.",
      "answer": "Mercury"
    },
    {
      "id": "ultimate-collection-537",
      "riddle": "What has 6 wheels and flies?",
      "answer": "Garbage truck"
    },
    {
      "id": "ultimate-collection-538",
      "riddle": "If not preceded by the smaller the larger one will not go.",
      "answer": "Key"
    },
    {
      "id": "ultimate-collection-539",
      "riddle": "On your desk, Or on the floor, You might just find one of my forms. With tails, without tails. Gray, black, or even white. If you see me, You might scream with fear, Or you might use me to work on what is near. What am I?",
      "answer": "Mouse"
    },
    {
      "id": "ultimate-collection-540",
      "riddle": "Of all the things that are broken, this makes the least noise And is always done on purpose.",
      "answer": "Fast"
    },
    {
      "id": "ultimate-collection-541",
      "riddle": "First I am one, then I seem none, in death I birth new life. What's raised exceeds me, for on bent knee, I add to a world that's rife. What am I?",
      "answer": "Seed"
    },
    {
      "id": "ultimate-collection-542",
      "riddle": "What comes once in a minute, twice in a moment, but never in a thousand years?",
      "answer": "Letter M"
    },
    {
      "id": "ultimate-collection-543",
      "riddle": "The restraining hand It keeps us from going From doing horrible things Hard to live with What is it?",
      "answer": "Conscience"
    },
    {
      "id": "ultimate-collection-544",
      "riddle": "My scrawny friend, weeps when he stride.",
      "answer": "Broom"
    },
    {
      "id": "ultimate-collection-545",
      "riddle": "What can go up a drainpipe down but not down a drainpipe up?",
      "answer": "Umbrella"
    },
    {
      "id": "ultimate-collection-546",
      "riddle": "What has yellow skin and writes?",
      "answer": "Ballpoint banana"
    },
    {
      "id": "ultimate-collection-547",
      "riddle": "Shoot at me a thousand times and I may still survive; one scratch from you and me will find your prospects take a dive. What am I?",
      "answer": "Eight ball"
    },
    {
      "id": "ultimate-collection-548",
      "riddle": "You throw away the outside and cook the inside. Then you eat the outside and throw away the inside.",
      "answer": "Corn"
    },
    {
      "id": "ultimate-collection-549",
      "riddle": "I'm in cooper But not in dog I'm in percent but not in MONEY What I'm I?",
      "answer": "Letter P"
    },
    {
      "id": "ultimate-collection-550",
      "riddle": "My voice is tender, my waist is slender and I'm often invited to play. Yet wherever I go I must take my bow or else I have nothing to say. What am I?",
      "answer": "Violin"
    },
    {
      "id": "ultimate-collection-551",
      "riddle": "Name an eight-letter word that has kst in the middle, in the beginning, and at the end.",
      "answer": "Inkstand"
    },
    {
      "id": "ultimate-collection-552",
      "riddle": "What is it that after you take away the whole, some still remains?",
      "answer": "Wholesome"
    },
    {
      "id": "ultimate-collection-553",
      "riddle": "I am something many people don't enjoy having as a friend, including you. But I am called upon anytime someone is injured. I have 5 letters and when my last letter is put before my first letter, I become a country. What am I?",
      "answer": "Spain"
    },
    {
      "id": "ultimate-collection-554",
      "riddle": "What tastes better than it smells?",
      "answer": "Tongue"
    },
    {
      "id": "ultimate-collection-555",
      "riddle": "With pointed fangs I sit and wait, with piercing force I serve out fate. Grabbing bloodless victims, proclaiming my might; physically joining with a single bite. What am I?",
      "answer": "Stapler"
    },
    {
      "id": "ultimate-collection-556",
      "riddle": "My first is in FLOWER and in ROSE My second is in FORK and well as HOSE My third is in CROCUS but not in GNOME My fourth is in RAKE never in HOME My fifth is in HOE and also in WEEDS My sixth is in SHEARS though not in SEEDS My seventh is in LADYBIRD not in CREATURE What am I?",
      "answer": "Flowers"
    },
    {
      "id": "ultimate-collection-557",
      "riddle": "He has married many women, but has never been married. Who is he?",
      "answer": "Priest"
    },
    {
      "id": "ultimate-collection-558",
      "riddle": "A muttered rumble was heard from the pen, And I, in my walking, stopped to look in. What was this I saw? A massive beast, hooved, and jawed. With spikes upon its mighty brow, I watched as he struck the turf and prowled. And yet for all of his magnificence, He couldn't get out of that wooden fence.",
      "answer": "Bull"
    },
    {
      "id": "ultimate-collection-559",
      "riddle": "What can be felt yet has neither length, breadth nor thickness?",
      "answer": "Emotion"
    },
    {
      "id": "ultimate-collection-560",
      "riddle": "I'm almost next to Merlin When it comes to his fame Though to many men I can be a pain For I can be in the way When I'm left too long But to the wise, I might say They sometimes think I belong. What am I?",
      "answer": "Beard"
    },
    {
      "id": "ultimate-collection-561",
      "riddle": "If you stay below me, you'll never go through But usually that is not what people do",
      "answer": "Door"
    },
    {
      "id": "ultimate-collection-562",
      "riddle": "There are 3 words in the English language. These three words all end in -gry. One is hungry, the other is angry. The third is one that you use every day, if you were paying attention I already gave you the answer.",
      "answer": "Language"
    },
    {
      "id": "ultimate-collection-563",
      "riddle": "I open to close but I close to open. I'm surrounded by water but I'm never soaking. What am I?",
      "answer": "Drawbridge"
    },
    {
      "id": "ultimate-collection-564",
      "riddle": "To give me to someone I don't belong to is cowardly, but to take me is noble. I can be a game, but nobody wins. What am I?",
      "answer": "Blame"
    },
    {
      "id": "ultimate-collection-565",
      "riddle": "I have an end but no beginning, a home but no family, a space without room. I never speak but there is no word I cannot make. What am I?",
      "answer": "Keyboard"
    },
    {
      "id": "ultimate-collection-566",
      "riddle": "If I smile it also smiles. If I cry it also cries. If I shout it does nothing. What is it?",
      "answer": "Mirror"
    },
    {
      "id": "ultimate-collection-567",
      "riddle": "What stays where it is when it goes off?",
      "answer": "Alarm clock"
    },
    {
      "id": "ultimate-collection-568",
      "riddle": "I was not born, but I am here. I have no name, but I am given many. I was made by science and life.",
      "answer": "Clone"
    },
    {
      "id": "ultimate-collection-569",
      "riddle": "An island pig with a hair as hard as a nail.",
      "answer": "Porcupine"
    },
    {
      "id": "ultimate-collection-570",
      "riddle": "When I'm used, I'm useless, once offered, soon rejected. In desperation oft expressed, the intended not protected. What am I?",
      "answer": "Excuse"
    },
    {
      "id": "ultimate-collection-571",
      "riddle": "I have lakes with no fish. I have roads with no cars.",
      "answer": "Map"
    },
    {
      "id": "ultimate-collection-572",
      "riddle": "Four hang, four sprang, two point the way, two to ward off dogs, one dangles after, always rather dirty. What am I?",
      "answer": "Cow"
    },
    {
      "id": "ultimate-collection-573",
      "riddle": "I know what you're wearing but cannot see. I know what you're eating but cannot smell. I know what you're what you're doing but cannot hear. What am I?",
      "answer": "Scale"
    },
    {
      "id": "ultimate-collection-574",
      "riddle": "With sharp edged wit and pointed poise, it can settle disputes without making a noise. What is it?",
      "answer": "Sword"
    },
    {
      "id": "ultimate-collection-575",
      "riddle": "What has 4 legs in the morning, 2 legs in the afternoon and 3 legs at night?",
      "answer": "Human"
    },
    {
      "id": "ultimate-collection-576",
      "riddle": "There is a bush fit for the nonce That beareth pricks and precious stones The fruit in fear some ladies pull. Tis smooth and round and plump and full... They put it in, and then they move it, Which makes it melt, and then they love it. So what was round, plump, full and hard Grows lank and thin and dull and marred...",
      "answer": "Strawberry"
    },
    {
      "id": "ultimate-collection-577",
      "riddle": "You hear it speak, for it has a hard tongue. But it cannot breathe, for it has not a lung. What is it?",
      "answer": "Bell"
    },
    {
      "id": "ultimate-collection-578",
      "riddle": "You throw me out when you need me; you bring me back when you're done. What am I?",
      "answer": "Anchor"
    },
    {
      "id": "ultimate-collection-579",
      "riddle": "I weigh a lot but backwards I am not. What am I?",
      "answer": "Ton"
    },
    {
      "id": "ultimate-collection-580",
      "riddle": "There's a boy. What's his name?",
      "answer": "Theresa Boy"
    },
    {
      "id": "ultimate-collection-581",
      "riddle": "7 months have 31 days. How many months have 28 days?",
      "answer": "All of them"
    },
    {
      "id": "ultimate-collection-582",
      "riddle": "Twigs and spheres and poles and plates, join and bind to reason make.",
      "answer": "Molecule"
    },
    {
      "id": "ultimate-collection-583",
      "riddle": "I am green but not a tree And I grow around the world What am I?",
      "answer": "Moss"
    },
    {
      "id": "ultimate-collection-584",
      "riddle": "There is a thing on earth that God could do but didn't, the devil hadn't got the power, and men do it.",
      "answer": "Repent"
    },
    {
      "id": "ultimate-collection-585",
      "riddle": "In a tunnel of darkness lies a beast of iron. It can only attack when pulled back.",
      "answer": "Bullet"
    },
    {
      "id": "ultimate-collection-586",
      "riddle": "A man shaves several times a day, yet he still has a beard. Who is this man?",
      "answer": "Barber"
    },
    {
      "id": "ultimate-collection-587",
      "riddle": "I drive men mad. For love of me, Easily beaten, never free.",
      "answer": "Gold"
    },
    {
      "id": "ultimate-collection-588",
      "riddle": "What kind of umbrella do most people carry on a rainy day?",
      "answer": "Wet one"
    },
    {
      "id": "ultimate-collection-589",
      "riddle": "It can only exist between any two things And men know it well for the hardships it brings.",
      "answer": "Distance"
    },
    {
      "id": "ultimate-collection-590",
      "riddle": "What type of son does no parent want?",
      "answer": "Arson"
    },
    {
      "id": "ultimate-collection-591",
      "riddle": "What belongs to you but others use it more than you do?",
      "answer": "Name"
    },
    {
      "id": "ultimate-collection-592",
      "riddle": "You can do it in vessels for getting you clean. You can do it to fabric to stop being seen. You are doing it when you've come up short. You've done it too when you've equaled in sport. This may sound like there should be images but then you can do all those things without pencil or pen. What is the word?",
      "answer": "Draw"
    },
    {
      "id": "ultimate-collection-593",
      "riddle": "It runs having no feet and it roars having no mouth.",
      "answer": "River"
    },
    {
      "id": "ultimate-collection-594",
      "riddle": "I am an insect and the first half of my name reveals another insect. Some famous musicians had a name similar to mine. What am I?",
      "answer": "Beetle"
    },
    {
      "id": "ultimate-collection-595",
      "riddle": "The one who makes it sells it. The one who buys it doesn't use it. The one who's using it doesn't know he's using it. What is it?",
      "answer": "Coffin"
    },
    {
      "id": "ultimate-collection-596",
      "riddle": "What's made of wood but can't be sawed?",
      "answer": "Sawdust"
    },
    {
      "id": "ultimate-collection-597",
      "riddle": "It never goes airborne, Yet, still, it may land.",
      "answer": "Punch"
    }
  ]
}
